{"index":{}}
{"symbol":"ACWF","fund_name":"iShares Edge MSCI Multifactor Global ETF","rating":3,"morningstar_category":"World Large Stock","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI ACWI Diversified Multiple-Factor Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is designed to contain equity securities from the MSCI ACWI Index (the \\\"parent index\\\") that have high exposure to four investment style factors: value, quality, momentum and low size, while maintaining a level of risk similar to that of the parent index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ACWI","fund_name":"iShares MSCI ACWI ETF","rating":3,"morningstar_category":"World Large Stock","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI ACWI composed of large- and mid-capitalization developed and emerging market equities.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization index designed to measure the combined equity market performance of developed and emerging markets countries.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"ACWV","fund_name":"iShares Edge MSCI Min Vol Global ETF","rating":5,"morningstar_category":"World Large Stock","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI ACWI Minimum Volatility (USD) Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index measures the combined performance of equity securities in both developed and emerging markets that, in the aggregate, have lower volatility relative to the broader developed and emerging markets.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"AGGY","fund_name":"WisdomTree Yield Enhanced U.S. Aggregate Bond Fund","rating":3,"morningstar_category":"Intermediate-Term Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg Barclays U.S. Aggregate Enhanced Yield Index (the \\\"index\\\").\\n Under normal circumstances, the fund will invest at least 80% of its total asset in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to broadly capture the U.S. investment grade, fixed income securities market while seeking to enhance yield within desired risk parameters and constraints. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AGND","fund_name":"WisdomTree Barclays Negative Duration U.S. Aggregate Bond Fund","rating":1,"morningstar_category":"Nontraditional Bond","category":"Equity","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg Barclays Rate Hedged U.S. Aggregate Bond Index, Negative Five Duration (the \\\"index\\\").\\n The index is designed to provide long exposure to the Bloomberg Barclays U.S. Aggregate Bond Index while seeking to manage interest rate risk through the use of short positions in U.S. Treasury securities. The fund employs a \\\"passive management\\\" - or indexing - investment approach designed to track the performance of the index. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"AGT","fund_name":"iShares MSCI Argentina and Global Exposure ETF","morningstar_category":"Miscellaneous Region","category":"International","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the MSCI All Argentina 25\/50 Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the broad Argentina equity universe, while including a minimum number of constituents, as defined by MSCI, Inc. (the \\\"index provider\\\" or \\\"MSCI\\\"). The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"AGZ","fund_name":"iShares Agency Bond ETF","rating":5,"morningstar_category":"Short Government","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Bloomberg Barclays U.S. Agency Bond Index.\\n The underlying index measures the performance of the agency sector of the U.S. government bond market and is comprised of investment-grade U.S. dollar-denominated publicly-issued government agency bonds or debentures. The fund generally will invest at least 90% of its assets in the component securities of the underlying index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AGZD","fund_name":"WisdomTree Interest Rate Hedged U.S. Aggregate Bond Fund","rating":2,"morningstar_category":"Nontraditional Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg Barclays Rate Hedged U.S. Aggregate Bond Index, Zero Duration (the \\\"index\\\").\\n The index is designed to provide long exposure to the Bloomberg Barclays U.S. Aggregate Bond Index while seeking to manage interest rate risk through the use of short positions in U.S. Treasury securities. The fund normally invests at least 80% of its total assets in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"AIRR","fund_name":["First Trust RBA American Industrial Renaissance® ETF"],"rating":3,"morningstar_category":"Industrials","category":"Equity","family":"First Trust","market_cap":"small","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an index called the Richard Bernstein Advisors American Industrial Renaissance® Index (the \\\"index\\\").\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in U.S. equity securities that comprise the index. The index is designed to measure the performance of small and mid cap U.S. companies in the industrial and community banking sectors.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"ALD","fund_name":["WisdomTree Asia Local Debt ETF"],"rating":4,"morningstar_category":"Emerging-Markets Local-Currency Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks a high level of total return consisting of both income and capital appreciation.\\n The fund normally invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in Local Debt. The advisor intends to focus its investments on Local Debt issued by governments (national, state, and local), government agencies and instrumentalities, and government sponsored enterprises. The fund may invest up to 20% of its assets in debt instruments denominated in U.S. dollars issued by Asian governments and government sponsored enterprises. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ALTS","fund_name":"ProShares Morningstar Alternatives Solution ETF","rating":3,"morningstar_category":"Multialternative","category":"Equity","family":"ProShares","market_cap":"mid","description":"The investment seeks investment results, before fees and expenses, that track the performance of the Morningstar® Diversified Alternatives IndexSM (the \\\"index\\\").\\n The fund is a fund of ETFs and seeks to achieve its investment objective by investing primarily in the underlying ETFs. It is designed to provide investors with a comprehensive solution to their alternatives allocation by investing in the alternative ETFs comprising its index. The index is designed to provide diversified exposure to alternative asset classes when combined with a range of traditional investments. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"AOA","fund_name":"iShares Core Aggressive Allocation ETF","rating":4,"morningstar_category":"Allocation--70% to 85% Equity","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the S&P Target Risk Aggressive Index composed of a portfolio of underlying equity and fixed income funds intended to represent an aggressive target risk allocation strategy.\\n The fund is a fund of funds and seeks its investment objective by investing primarily in other iShares Underlying Funds that themselves seek investment results corresponding to their own respective underlying indexes. It generally will invest at least 90% of its assets in the component securities of the underlying index. The index measures the performance of the S&P Dow Jones Indices LLC proprietary allocation model.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AOK","fund_name":"iShares Core Conservative Allocation ETF","rating":2,"morningstar_category":"Allocation--30% to 50% Equity","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the S&P Target Risk Conservative Index composed of a portfolio of underlying equity and fixed income funds intended to represent a conservative target risk allocation strategy.\\n The fund is a fund of funds and seeks its investment objective by investing primarily in other iShares Underlying Funds that themselves seek investment results corresponding to their own respective underlying indexes. It generally will invest at least 90% of its assets in the component securities of the underlying index. The index measures the performance of the S&P Dow Jones Indices LLC proprietary allocation model.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AOM","fund_name":"iShares Core Moderate Allocation ETF","rating":3,"morningstar_category":"Allocation--30% to 50% Equity","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the S&P Target Risk Moderate Index composed of a portfolio of underlying equity and fixed income funds intended to represent a moderate target risk allocation strategy.\\n The fund is a fund of funds and seeks its investment objective by investing primarily in other iShares Underlying Funds that themselves seek investment results corresponding to their own respective underlying indexes. It generally will invest at least 90% of its assets in the component securities of the underlying index. The index measures the performance of the S&P Dow Jones Indices LLC proprietary allocation model.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AOR","fund_name":"iShares Core Growth Allocation ETF","rating":3,"morningstar_category":"Allocation--50% to 70% Equity","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the S&P Target Risk Growth Index composed of a portfolio of underlying equity and fixed income funds intended to represent a growth allocation target risk strategy.\\n The fund is a fund of funds and seeks its investment objective by investing primarily in other iShares Underlying Funds that themselves seek investment results corresponding to their own respective underlying indexes. It generally will invest at least 90% of its assets in the component securities of the underlying index. The index measures the performance of the S&P Dow Jones Indices LLC proprietary allocation model.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AUSE","fund_name":"WisdomTree Australia Dividend ETF","rating":4,"morningstar_category":"Miscellaneous Region","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Australia Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of high-dividend yielding companies in Australia. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"AXJL","fund_name":"WisdomTree Asia Pacific ex-Japan ETF","rating":2,"morningstar_category":"Pacific\/Asia ex-Japan Stk","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Asia Pacific ex-Japan Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of dividend-paying companies in the Asia Pacific region, excluding Japan. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"BAB","fund_name":"Invesco Taxable Municipal Bond ETF","rating":5,"morningstar_category":"Long-Term Bond","category":"Bond","family":"Invesco","market_cap":null,"description":"The investment seeks to track the investment results (before fees and expenses) of the ICE BofAML US Taxable Municipal Securities Plus Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 80% of its total assets in taxable municipal securities that comprise the underlying index. The underlying index is designed to track the performance of U.S. dollar-denominated taxable municipal debt publicly issued by U.S. states and territories, and their political subdivisions, in the U.S. market.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"BIL","fund_name":"SPDR® Bloomberg Barclays 1-3 Month T-Bill ETF","rating":1,"morningstar_category":"Ultrashort Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays 1-3 Month U.S. Treasury Bill Index.\\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity of greater than or equal to 1 month and less than 3 months. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"BTAL","fund_name":"AGFiQ U.S. Market Neutral Anti-Beta Fund","rating":4,"morningstar_category":"Market Neutral","category":"Equity","family":"AGFiQ","market_cap":"mid","description":"The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Anti-Beta Index.\\n The fund invests at least 80% of its net assets in common stock of the long positions in the underlying index and sells short at least 80% of the short positions in the underlying index. The underlying index is a long\/short market neutral index that is dollar-neutral. As such, it identifies long and short securities positions of approximately equal dollar amounts.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"CARZ","fund_name":"First Trust NASDAQ Global Auto Index Fund","rating":1,"morningstar_category":"Consumer Cyclical","category":"Sector","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ OMX Global Auto Index(SM).\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts representing securities in the index. The index is designed to track the performance of the largest and most liquid companies engaged in manufacturing of automobiles. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"CEMB","fund_name":"iShares J.P. Morgan EM Corporate Bond ETF","rating":3,"morningstar_category":"Emerging Markets Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the J.P. Morgan CEMBI Broad Diversified Core Index composed of U.S. dollar-denominated, emerging market corporate bonds.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index tracks the performance of the U.S. dollar-denominated emerging market corporate bond market.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"CEW","fund_name":"WisdomTree Emerging Currency Strategy Fund","morningstar_category":"Multicurrency","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to achieve total returns reflective of both money market rates in selected emerging market countries available to foreign investors and changes to the value of these currencies relative to the U.S. dollar.\\n The fund will invest, under normal circumstances, at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in investments whose combined performance is tied economically to selected emerging market countries. It generally will maintain a weighted average portfolio maturity of 90 days or less with respect to the money market securities in its portfolio. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"CHEP","fund_name":"AGFiQ U.S. Market Neutral Value Fund","rating":1,"morningstar_category":"Market Neutral","category":"Equity","family":"AGFiQ","market_cap":"mid","description":"The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Value Index.\\n The fund invests at least 80% of its net assets in common stock of the long positions in the underlying index and sells short at least 80% of the short positions in the underlying index. The index is a long\/short market neutral index that is dollar-neutral. As such, it identifies long and short securities positions of approximately equal dollar amounts. In choosing to track a market neutral index, the fund seeks to limit the effects of general market movements on the fund.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"CIBR","fund_name":"First Trust NASDAQ Cybersecurity ETF","rating":2,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Nasdaq CTA Cybersecurity IndexSM (the \\\"index\\\").\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts that comprise the index. The index will include securities of companies classified as \\\"cyber security\\\" companies by the CTA. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"CJNK","fund_name":"SPDR® ICE BofAML Crossover Corporate Bond ETF","rating":4,"morningstar_category":"Corporate Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks investment results that, before fees and expenses, correspond generally to the price and yield performance of the ICE BofAML US Diversified Crossover Corporate Index.\\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of U.S. dollar denominated BBB and BB corporate debt publicly issued in the U.S. domestic market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"CNYA","fund_name":"iShares MSCI China A ETF","morningstar_category":"China Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI China A Inclusion Index composed of domestic Chinese equities that trade on the Shanghai or Shenzhen Stock Exchange.\\n The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index. The index is designed to measure the equity market performance in the People's Republic of China, as represented by \\\"A-shares\\\" that are accessible through the Shanghai Connect or the Shenzhen-Hong Kong Stock Connect program. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"CWB","fund_name":"SPDR® Bloomberg Barclays Convertible Securities ETF","rating":4,"morningstar_category":"Convertibles","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Convertible Liquid Bond Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to represent the market of U.S. convertible securities, such as convertible bonds and convertible preferred stock. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"CXSE","fund_name":"WisdomTree China ex-State-Owned Enterprises Fund","rating":4,"morningstar_category":"China Region","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree China ex-State-Owned Enterprises Index.\\n Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a float-adjusted market cap weighted index that consists of common stocks in China, excluding common stocks of \\\"state-owned enterprises.\\\" The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"CYB","fund_name":"WisdomTree Chinese Yuan Strategy Fund","morningstar_category":"Single Currency","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to achieve total returns reflective of both money market rates in China available to foreign investors and changes in value of the Chinese yuan relative to the U.S. dollar.\\n The fund normally invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in investments whose combined performance is economically tied to China. It is an actively managed exchange traded fund (\\\"ETF\\\"). The fund generally will maintain a weighted average portfolio maturity of 90 days or less with respect to the money market securities in its portfolio. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DBA","fund_name":"Invesco DB Agriculture Fund","morningstar_category":"Commodities Agriculture","category":"Commodity","family":"Invesco","market_cap":null,"description":"The investment seeks to track changes, whether positive or negative, in the level of the DBIQ Diversified Agriculture Index Excess Return™ (the “index”) over time, plus the excess, if any, of the sum of the fund’s Treasury Income, Money Market Income and T-Bill ETF Income, over the expenses of the fund. The index, which is comprised of one or more underlying commodities (“index commodities”), is intended to reflect the agricultural sector.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DDEZ","fund_name":"WisdomTree Dynamic Currency Hedged Europe Equity Fund","morningstar_category":"Europe Stock","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Dynamic Currency Hedged Europe Equity Index.\\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to European equity securities while at the same time dynamically hedging currency exposure to fluctuations between the value of the euro and the USD. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"DDJP","fund_name":"WisdomTree Dynamic Currency Hedged Japan Equity Fund","morningstar_category":"Japan Stock","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, of the WisdomTree Dynamic Currency Hedged Japan Equity Index.\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to Japanese equity securities while at the same time dynamically hedging currency exposure to fluctuations between the value of the Japanese yen and the USD. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"DDLS","fund_name":"WisdomTree Dynamic Currency Hedged International SmallCap Equity Fund","morningstar_category":"Foreign Small\/Mid Value","category":"International","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the WisdomTree Dynamic Currency Hedged International SmallCap Equity Index.\\n The fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to small-capitalization equity securities in the industrialized world, excluding Canada and U.S., while at the same time dynamically hedging currency exposure to fluctuations between the value of foreign currencies and the USD. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"DDWM","fund_name":"WisdomTree Dynamic Currency Hedged International Equity Fund","morningstar_category":"Foreign Large Value","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the WisdomTree Dynamic Currency Hedged International Equity Index.\\n The fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to equity securities in the industrialized world, excluding Canada and the United States, while at the same time dynamically hedging currency exposure to fluctuations between the value of the applicable foreign currencies and the USD. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"DEM","fund_name":"WisdomTree Emerging Markets High Dividend Fund","rating":3,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Emerging Markets High Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the highest dividend-yielding common stocks selected from the WisdomTree Emerging Markets Dividend Index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DES","fund_name":"WisdomTree U.S. SmallCap Dividend Fund","rating":4,"morningstar_category":"Small Value","category":"Equity","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. SmallCap Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index measuring the performance of the small-capitalization segment of the U.S. dividend-paying market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DEW","fund_name":"WisdomTree Global High Dividend Fund","rating":2,"morningstar_category":"World Large Stock","category":"Equity","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance of the WisdomTree Global High Dividend Index.\\n The fund will invest at least 95% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of high dividend-yielding companies selected from the WisdomTree Global Dividend Index, which defines the dividend-paying universe of companies in the U.S., developed countries and emerging markets throughout the world. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DFE","fund_name":"WisdomTree Europe SmallCap Dividend Fund","rating":4,"morningstar_category":"Europe Stock","category":"International","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe SmallCap Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the small-capitalization segment of the European dividend-paying market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DFJ","fund_name":"WisdomTree Japan SmallCap Dividend Fund","rating":4,"morningstar_category":"Japan Stock","category":"International","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Japan SmallCap Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is comprised of dividend-paying small capitalization companies in Japan. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DGRE","fund_name":"WisdomTree Emerging Markets Quality Dividend Growth Fund","rating":3,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks income and capital appreciation.\\n The fund seeks to achieve its investment objective by investing primarily in emerging market dividend-paying common stocks with growth characteristics. The adviser, using a disciplined model-based process focused on a long-term approach to investing, seeks to identify dividend-paying companies with strong corporate profitability and sustainable growth characteristics. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"DGRS","fund_name":"WisdomTree U.S. SmallCap Quality Dividend Growth Fund","rating":3,"morningstar_category":"Small Blend","category":"Equity","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. SmallCap Quality Dividend Growth Index.\\n The index is a fundamentally weighted index that consists of the small-capitalization segment of dividend-paying U.S. common stocks with growth characteristics. Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"DGS","fund_name":"WisdomTree Emerging Markets SmallCap Dividend Fund","rating":4,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Emerging Markets SmallCap Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of small cap common stocks selected from the WisdomTree Emerging Markets Dividend Index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DIM","fund_name":"WisdomTree International MidCap Dividend Fund","rating":4,"morningstar_category":"Foreign Small\/Mid Value","category":"International","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International MidCap Dividend Index.\\n The fund normally invests at least 95% of its total assets (exclusive of collateral held from securities lending) in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the mid-capitalization segment of the dividend-paying market in the industrialized world outside the U.S. and Canada. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DLS","fund_name":"WisdomTree International SmallCap Dividend Fund","rating":4,"morningstar_category":"Foreign Small\/Mid Value","category":"International","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International SmallCap Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is comprised of the small-capitalization segment of the dividend-paying market in the industrialized world outside the U.S. and Canada. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DNL","fund_name":"WisdomTree Global ex-U.S. Quality Dividend Growth Fund","rating":2,"morningstar_category":"Foreign Large Growth","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Global ex-U.S. Quality Dividend Growth Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that consists of dividend-paying global ex-U.S. common stocks with growth characteristics. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DOL","fund_name":"WisdomTree International LargeCap Dividend Fund","rating":3,"morningstar_category":"Foreign Large Value","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International LargeCap Dividend Index.\\n The fund normally invests at least 95% of its total assets (exclusive of collateral held from securities lending) in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the large-capitalization segment of the dividend-paying market in the industrialized world outside the U.S. and Canada. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DON","fund_name":"WisdomTree U.S. MidCap Dividend Fund","rating":5,"morningstar_category":"Mid-Cap Value","category":"Equity","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. MidCap Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the mid-capitalization segment of the U.S. dividend-paying market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DOO","fund_name":"WisdomTree International Dividend ex-Financials Fund","rating":4,"morningstar_category":"Foreign Large Value","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International Dividend ex-Financials Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of high dividend-yielding international common stocks outside the financial sector. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DRW","fund_name":"WisdomTree Global ex-US Real Estate Fund","rating":4,"morningstar_category":"Global Real Estate","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Global ex-U.S. Real Estate Index.\\n Under normal circumstances, at least 95% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of companies from developed and emerging markets outside of the United States that are classified as being part of the \\\"Global Real Estate\\\" sector. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DTH","fund_name":"WisdomTree International High Dividend Fund","rating":3,"morningstar_category":"Foreign Large Value","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International High Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of companies with high dividend yields selected from the WisdomTree International Equity Index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DTN","fund_name":"WisdomTree U.S. Dividend ex-Financials Fund","rating":4,"morningstar_category":"Large Value","category":"Equity","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. Dividend ex-Financials Index.\\n The fund normally invests at least 95% of its total assets (exclusive of collateral held from securities lending) in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is comprised of the 10 highest dividend-yielding companies in each sector, selected from the three hundred largest companies by market value in the WisdomTree U.S. Dividend Index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DVEM","fund_name":"WisdomTree Emerging Markets Dividend Fund","morningstar_category":"Diversified Emerging Mkts","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Emerging Markets Dividend Index (the \\\"index\\\").\\n Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index that consists of emerging market dividend-paying common stocks. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"DWIN","fund_name":"Invesco DWA Tactical Multi-Asset Income ETF","morningstar_category":"Allocation--30% to 50% Equity","category":"Equity","family":"Invesco","market_cap":null,"description":"The investment seeks to track the investment results (before fees and expenses) of the Dorsey Wright® Multi-Asset Income Index.\\n The fund generally will invest at least 90% of its total assets in securities that comprise the underlying index. It is a \\\"fund of funds,\\\" meaning that it invests substantially all of its assets in the shares of other ETFs eligible for inclusion in the underlying index, rather than in securities of individual companies. The underlying index seeks to gain exposure to the income-producing segments of the U.S. securities market that display the strongest relative strength, as evaluated on a monthly basis. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"DWM","fund_name":"WisdomTree International Equity Fund","rating":4,"morningstar_category":"Foreign Large Value","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International Equity Index.\\n At least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of dividend-paying companies in the industrialized world, excluding Canada and the United States, that pay regular cash dividends. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DXGE","fund_name":"WisdomTree Germany Hedged Equity Fund","morningstar_category":"Miscellaneous Region","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Germany Hedged Equity Index (the \\\"index\\\").\\n The fund normally invests at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to Germany equity markets while at the same time neutralizing exposure to fluctuations of the value of the euro relative to the U.S. dollar. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"DXJ","fund_name":"WisdomTree Japan Hedged Equity Fund","rating":1,"morningstar_category":"Japan Stock","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Japan Hedged Equity Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to provide exposure to Japanese equity markets while at the same time neutralizing exposure to fluctuations of the Japanese yen relative to the U.S. dollar. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DXJF","fund_name":"WisdomTree Japan Hedged Financials Fund","rating":1,"morningstar_category":"Japan Stock","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Japan Hedged Financials Index (the \\\"index\\\").\\n Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of companies incorporated in Japan that trade primarily on the Tokyo Stock Exchange. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"DXJS","fund_name":"WisdomTree Japan Hedged SmallCap Equity Fund","rating":4,"morningstar_category":"Japan Stock","category":"International","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Japan Hedged SmallCap Equity Index.\\n The fund normally invests at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to Japanese equity markets while at the same time neutralizing exposure to fluctuations of the value of the Japanese yen relative to the U.S. dollar. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"DYB","fund_name":"WisdomTree Dynamic Bearish U.S. Equity Fund","morningstar_category":"Bear Market","category":"Equity","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Dynamic Bearish U.S. Equity Index.\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index includes: (i) long U.S. equity positions (the \\\"Long Equity Basket\\\") or long U.S. Treasury positions (the \\\"Long Treasury Basket\\\"); and (ii) short U.S. equity positions (the \\\"Short Equity Basket\\\"). The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"DYLS","fund_name":"WisdomTree Dynamic Long\/Short U.S. Equity Fund","rating":5,"morningstar_category":"Long-Short Equity","category":"Equity","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Dynamic Long\/Short U.S. Equity Index (the \\\"index\\\").\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index includes long U.S. equity positions (the \\\"Long Equity Basket\\\") and, at times, short U.S. equity positions (the \\\"Short Equity Basket\\\"). The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"EBND","fund_name":"SPDR® Bloomberg Barclays Emerging Markets Local Bond ETF","rating":4,"morningstar_category":"Emerging-Markets Local-Currency Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays EM Local Currency Government Diversified Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Sub-Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the fixed-rate local currency sovereign debt of emerging market countries. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ECNS","fund_name":"iShares MSCI China Small-Cap ETF","rating":2,"morningstar_category":"China Region","category":"International","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the MSCI China Small Cap Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the performance of equity securities in the bottom 14% by market capitalization of the Chinese equity securities markets, as represented by the H-Shares and B-Shares markets.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EDIV","fund_name":"SPDR® S&P Emerging Markets Dividend ETF","rating":3,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Emerging Markets Dividend Opportunities Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of 100 high-yielding emerging market common stocks. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EDOM","fund_name":"WisdomTree Europe Domestic Economy Fund","rating":2,"morningstar_category":"Europe Stock","category":"International","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Domestic Economy Index.\\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed with a goal of maximizing exposure to European companies with significant European revenue that may benefit from an economic recovery in Europe and increased buying power by Europeans. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"EEMX","fund_name":"SPDR® MSCI Emerging Markets Fossil Fuel Free ETF","morningstar_category":"Diversified Emerging Mkts","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the MSCI Emerging Markets ex Fossil Fuels Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of companies in the MSCI Emerging Markets Index that are \\\"fossil fuel reserves free,\\\" which are defined as companies that do not own fossil fuel reserves. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EES","fund_name":"WisdomTree U.S. SmallCap Earnings Fund","rating":5,"morningstar_category":"Small Blend","category":"Equity","family":"WisdomTree","market_cap":"small","description":"he investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. SmallCap Earnings Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of earnings-generating companies within the small-capitalization segment of the U.S. stock market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EFAX","fund_name":"SPDR® MSCI EAFE Fossil Fuel Free ETF","morningstar_category":"Foreign Large Blend","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the MSCI EAFE ex Fossil Fuels Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of companies in the MSCI EAFE Index that are \\\"fossil fuel reserves free,\\\" which are defined as companies that do not own fossil fuel reserves. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EFG","fund_name":"iShares MSCI EAFE Growth ETF","rating":3,"morningstar_category":"Foreign Large Growth","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI EAFE Growth Index composed of developed market equities, excluding the U.S. and Canada, that exhibit growth characteristics.\\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The index is a subset of the MSCI EAFE Index. Constituents of the underlying index include securities of companies located in Europe, Australasia and the Far East.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"EFV","fund_name":"iShares MSCI EAFE Value ETF","rating":3,"morningstar_category":"Foreign Large Value","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI EAFE Value Index composed of developed market equities, excluding the U.S. and Canada, that exhibit value characteristics.\\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index is a subset of the MSCI EAFE Index. Constituents of the underlying index include securities from Europe, Australasia and the Far East.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"ELD","fund_name":"WisdomTree Emerging Markets Local Debt Fund","rating":3,"morningstar_category":"Emerging-Markets Local-Currency Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks a high level of total return consisting of both income and capital appreciation.\\n The fund seeks to achieve its investment objective through investment in bonds and other debt instruments denominated in the local currencies of emerging market countries. Under normal circumstances, it will invest at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in Local Debt. The Advisor attempts to maintain an aggregate portfolio duration of between two and ten years under normal market conditions. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EMB","fund_name":"iShares J.P. Morgan USD Emerging Markets Bond ETF","rating":3,"morningstar_category":"Emerging Markets Bond","category":"Equity","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the J.P. Morgan EMBI® Global Core Index composed of U.S. dollar-denominated, emerging market bonds.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index. The index is a broad, diverse U.S. dollar-denominated emerging markets debt benchmark that tracks the total return of actively traded external debt instruments in emerging market countries. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"EMCG","fund_name":"WisdomTree Emerging Markets Consumer Growth Fund","rating":1,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks income and capital appreciation.\\n The fund seeks to achieve its investment objective by investing primarily in consumer growth stocks in emerging markets that provide the best combined rank of growth, quality, and valuation characteristics. The adviser, using a disciplined model-based process focused on a long-term approach to investing, seeks to identify consumer stocks that benefit from long-term growth in emerging market economies. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"EMDV","fund_name":"ProShares MSCI Emerging Markets Dividend Growers ETF","morningstar_category":"Diversified Emerging Mkts","category":"International","family":"ProShares","market_cap":"large","description":"The investment seeks investment results, before fees and expenses, that track the performance of the MSCI Emerging Markets Dividend Masters Index (the \\\"index\\\").\\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities. The index, constructed and maintained by MSCI, targets companies that are currently members of the MSCI Emerging Markets Index (\\\"MSCI Emerging Markets\\\") and have increased dividend payments each year for at least 7 years.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"EMHY","fund_name":"iShares Emerging Markets High Yield Bond ETF","rating":4,"morningstar_category":"Emerging Markets Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Morningstar® Emerging Markets High Yield Bond IndexSM.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates. The index tracks the performance of the below-investment-grade U.S. dollar-denominated emerging market sovereign and corporate high yield bond market. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"EMLP","fund_name":"First Trust North American Energy Infrastructure Fund","rating":5,"morningstar_category":"Energy Limited Partnership","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks total return.\\n The fund invests at least 80% of its net assets in equity securities of companies deemed by the sub-advisor to be engaged in the energy infrastructure sector. These companies principally include publicly-traded MLPs and limited liability companies taxed as partnerships, MLP affiliates, pipeline companies, utilities, and other companies that derive the majority of their revenues from operating or providing services in support of infrastructure assets such as pipelines, power transmission and petroleum and natural gas storage in the petroleum, natural gas and power generation industries. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EMTL","fund_name":"SPDR® DoubleLine® Emerging Markets Fixed Income ETF","morningstar_category":"Emerging Markets Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide high total return from current income and capital appreciation.\\n Under normal circumstances, the fund will invest at least 80% of its net assets (plus the amount of borrowings for investment purposes) in emerging market fixed income securities. Fixed income securities are defined as fixed income securities issued or guaranteed by foreign corporations or foreign governments; corporate or government bonds; sovereign debt; structured securities; foreign currency transactions; certain derivatives; preferred securities; zero coupon bonds; credit-linked notes; pass through notes; bank loans; and perpetual maturity bonds.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"ENOR","fund_name":"iShares MSCI Norway ETF","morningstar_category":"Miscellaneous Region","category":"International","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the MSCI Norway IMI 25\/50 Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure broad-based equity market performance in Norway. A capping methodology is applied that limits the weight of any single component to a maximum of 25% of the underlying index. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"EPI","fund_name":"WisdomTree India Earnings Fund","rating":3,"morningstar_category":"India Equity","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree India Earnings Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is comprised of companies incorporated and traded in India that are profitable and that are eligible to be purchased by foreign investors as of the annual index screening date. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EPS","fund_name":"WisdomTree U.S. Earnings 500 Fund","rating":3,"morningstar_category":"Large Blend","category":"Equity","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. Earnings 500 Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of earnings-generating companies within the large-capitalization segment of the U.S. Stock Market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ERUS","fund_name":"iShares MSCI Russia Capped ETF","morningstar_category":"Miscellaneous Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Russia 25\/50 Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities listed on stock exchanges in Russia. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ESGD","fund_name":"iShares MSCI EAFE ESG Optimized ETF","morningstar_category":"Foreign Large Blend","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI EAFE Extended ESG Focus Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is composed of large- and mid-capitalization developed market equities, excluding the U.S. and Canada that have positive environmental, social and governance characteristics as identified by the index provider. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"ESGE","fund_name":"iShares ESG MSCI EM ETF","morningstar_category":"Diversified Emerging Mkts","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Emerging Markets Extended ESG Focus Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is an optimized equity index designed to reflect the equity performance of companies that have favorable ESG characteristics, while exhibiting risk and return characteristics similar to those of the MSCI Market Cap Weighted Index (the \\\"parent index\\\"). The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"ESGU","fund_name":"iShares MSCI USA ESG Optimized ETF","morningstar_category":"Large Blend","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Quality Dividend Growth Index.\\n At least 80% of the fund's total assets will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks of companies with growth characteristics that are incorporated and listed on a stock exchange in one of the following countries: Germany, Switzerland, United Kingdom, etc. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EUDG","fund_name":"WisdomTree Europe Quality Dividend Growth Fund","rating":3,"morningstar_category":"Europe Stock","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Quality Dividend Growth Index.\\n At least 80% of the fund's total assets will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks of companies with growth characteristics that are incorporated and listed on a stock exchange in one of the following countries: Germany, Switzerland, United Kingdom, etc. The fund is non-diversified","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EUSC","fund_name":"WisdomTree Europe Hedged SmallCap Equity Fund","rating":5,"morningstar_category":"Europe Stock","category":"International","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Hedged SmallCap Equity Index.\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to small cap equity securities within Europe, while at the same time neutralizing exposure to fluctuations between the value of the euro and the U.S. dollar. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EWH","fund_name":"iShares MSCI Hong Kong ETF","rating":5,"morningstar_category":"China Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Hong Kong Index.\\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index consists of stocks traded primarily on the Stock Exchange of Hong Kong Limited (SEHK). It may include large- or mid-capitalization companies. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EWL","fund_name":"iShares MSCI Switzerland Capped ETF","rating":5,"morningstar_category":"Miscellaneous Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Switzerland 25\/50 Index.\\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer of a component exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EWT","fund_name":"iShares MSCI Taiwan Capped ETF","rating":5,"morningstar_category":"China Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Taiwan 25\/50 Index.\\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index is designed to measure the performance of the large- and mid-cap segments of the Taiwanese market. A capping methodology is applied that limits the weight of any single component to a maximum of 25% of the underlying index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EWX","fund_name":"SPDR® S&P Emerging Markets Small Cap ETF","rating":3,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"SPDR","market_cap":"small","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Emerging Markets Under USD2 Billion Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a float-adjusted market capitalization weighted index designed to represent the small capitalization segment of emerging countries included in the S&P Global BMI. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EWZS","fund_name":"iShares MSCI Brazil Small-Cap ETF","rating":3,"morningstar_category":"Latin America Stock","category":"International","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the MSCI Brazil Small Cap Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the performance of equity securities in the bottom 14% by market capitalization of equity securities listed on stock exchanges in Brazil.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"EXT","fund_name":"WisdomTree U.S. Total Earnings Fund","rating":4,"morningstar_category":"Large Blend","category":"Equity","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. Earnings Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of earnings-generating companies within the broad U.S. stock market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EZM","fund_name":"WisdomTree U.S. MidCap Earnings Fund","rating":4,"morningstar_category":"Mid-Cap Blend","category":"Equity","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. MidCap Earnings Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of earnings-generating companies within the mid-capitalization segment of the U.S. stock market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"EZU","fund_name":"iShares MSCI Eurozone ETF","rating":2,"morningstar_category":"Europe Stock","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI EMU Index composed of large- and mid-capitalization equities from developed market countries that use the euro as their official currency.\\n The fund generally invests at least 95% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index consists of stocks from the following 10 developed market countries: Austria, Belgium, Finland, France, Germany, Ireland, Italy, the Netherlands, Portugal and Spain.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"FAAR","fund_name":"First Trust Alternative Absolute Return Strategy ETF","morningstar_category":"Commodities Broad Basket","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks to track the investment results of the MSCI EMU Index composed of large- and mid-capitalization equities from developed market countries that use the euro as their official currency.\\n The fund generally invests at least 95% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index consists of stocks from the following 10 developed market countries: Austria, Belgium, Finland, France, Germany, Ireland, Italy, the Netherlands, Portugal and Spain.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"FALN","fund_name":"iShares Fallen Angels USD Bond ETF","morningstar_category":"High Yield Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Bloomberg Barclays US High Yield Fallen Angel 3% Capped Index composed of U.S. dollar-denominated, high yield corporate bonds that were previously rated investment grade.\\n The fund generally will invest at least 90% of its assets in the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to reflect the performance of U.S. dollar denominated, high yield corporate bonds that were previously rated investment grade. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FAN","fund_name":"First Trust Global Wind Energy ETF","rating":1,"morningstar_category":"Miscellaneous Sector","category":"Commodity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the ISE Clean Edge Global Wind Energy Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts representing securities in the index. The index provides a benchmark for investors interested in tracking public companies throughout the world that are active in the wind energy industry based on analysis of the products and services offered by those companies. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FBT","fund_name":"First Trust NYSE Arca Biotechnology Index Fund","rating":3,"morningstar_category":"Health","category":"Equity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NYSE Arca Biotechnology IndexSM.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is an equal-dollar weighted index designed to measure the performance of a cross section of companies in the biotechnology industry that are primarily involved in the use of biological processes to develop products or provide services.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FBZ","fund_name":"First Trust Brazil AlphaDEX® Fund","rating":3,"morningstar_category":"Latin America Stock","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® Brazil Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ Brazil Index (the \\\"base index\\\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FCAN","fund_name":"First Trust Canada AlphaDEX® Fund","morningstar_category":"Miscellaneous Region","category":"International","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® Canada Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ Canada Index (the \\\"base index\\\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FCEF","fund_name":"First Trust CEF Income Opportunity ETF","morningstar_category":"World Allocation","category":"Bond","family":"First Trust","market_cap":"large","description":"The investment seeks to provide current income with a secondary emphasis on total return.\\n The fund will seek to achieve its investment objectives by investing at least 80% of its net assets (including investment borrowings) in a portfolio of closed-end investment companies that are listed and traded in the United States on registered exchanges. In selecting the closed-end funds for the fund's portfolio, the fund's investment advisor utilizes a range of investment approaches. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FCG","fund_name":"First Trust Natural Gas ETF","rating":1,"morningstar_category":"Equity Energy","category":"Commodity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the ISE-Revere Natural GasTM Index.\\n The fund will normally invest at least 90% of its net assets in equity securities that comprise the index. The index uses a linear-based capitalization-weighted methodology for each of the MLP and non-MLP group of constituents that initially ranks the equity securities based on market capitalization and average daily trading volume, and then adjusts the combined rankings of each equity security by a factor relating to its market capitalization.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FCVT","fund_name":"First Trust SSI Strategic Convertible Securities ETF","rating":3,"morningstar_category":"Convertibles","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks total return.\\n Under normal market conditions, the fund seeks to achieve its investment objective by investing at least 80% of its net assets (including investment borrowings) in a portfolio of U.S. and non-U.S. convertible securities. In general, convertible securities combine the investment characteristics of bonds and common stocks and typically consist of debt securities or preferred securities that may be converted or exchanged within a specified period of time into a certain amount of common stock or other equity security of the same or a different issuer. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FDN","fund_name":"First Trust Dow Jones Internet Index Fund","rating":4,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Dow Jones Internet Composite Index (SM) (the \\\"index\\\").\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is designed to include only companies whose primary focus is Internet-related. To be eligible for inclusion in the index, a company must generate at least 50% of its revenues from Internet commerce or services. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FEU","fund_name":"SPDR® STOXX Europe 50 ETF","rating":2,"morningstar_category":"Europe Stock","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the STOXX® Europe 50 Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. It employs a sampling strategy, which means that the fund is not required to purchase all of the securities represented in the index. The index is a market capitalization weighted index designed to represent the performance of some of the largest companies across all components of the 19 STOXX Europe 600 Supersector Indexes. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FGM","fund_name":"First Trust Germany AlphaDEX® Fund","morningstar_category":"Miscellaneous Region","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® Germany Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ Germany Index (the \\\"base index\\\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FIW","fund_name":"First Trust Water ETF","rating":4,"morningstar_category":"Miscellaneous Sector","category":"Commodity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the ISE Clean Edge Water Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified market-capitalization weighted portfolio of 36 stocks of companies as of March 29, 2018 that derive a substantial portion of their revenues from the potable and wastewater industries which are generally industrial and utilities companies.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FKO","fund_name":"First Trust South Korea AlphaDEX® Fund","morningstar_category":"Miscellaneous Region","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® South Korea Index.\\n The fund normally invests at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ South Korea Index (the \\\"base index\\\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FLM","fund_name":"First Trust Global Engineering and Construction ETF","rating":1,"morningstar_category":"industrials","category":"Sector","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the ISE Global Engineering and ConstructionTM Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts representing securities in the index. The index provides a benchmark for investors interested in tracking public companies throughout the world that are active in the engineering and construction industries, based on analysis of the products and services offered by those companies.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FLN","fund_name":"First Trust Latin America AlphaDEX® Fund","rating":4,"morningstar_category":"Latin America Stock","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® Latin America Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ Latin America Index (the \\\"base index\\\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FLOT","fund_name":"iShares Floating Rate Bond ETF","rating":3,"morningstar_category":"Ultrashort Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Bloomberg Barclays US Floating Rate Note < 5 Years Index (the \\\"underlying index\\\"), which measures the performance of U.S. dollar-denominated, investment-grade floating rate notes.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which BFA believes will help the fund track the underlying index.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"FLRN","fund_name":"SPDR® Bloomberg Barclays Investment Grade Floating Rate ETF","rating":4,"morningstar_category":"Ultrashort Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Dollar Floating Rate Note < 5 Years Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of U.S. dollar-denominated, investment grade floating rate notes. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FMB","fund_name":"First Trust Managed Municipal ETF","rating":5,"morningstar_category":"Muni National Interm","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks to generate current income that is exempt from regular federal income taxes and its secondary objective is long term capital appreciation.\\n Under normal market conditions, the fund seeks to achieve its investment objectives by investing at least 80% of its net assets (including investment borrowings) in municipal debt securities that pay interest that is exempt from regular federal income taxes (collectively, \\\"Municipal Securities\\\"). It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FNI","fund_name":"First Trust Chindia ETF","rating":2,"morningstar_category":"Miscellaneous Region","category":"International","family":"First Trust","market_cap":null,"description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the ISE ChIndiaTM Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in securities that comprise the index. The index is a modified market capitalization weighted of 50 American Depositary Receipts (\\\"ADRs\\\"), American Depositary Shares (\\\"ADSs\\\") and\/or stocks selected from a universe of all listed ADRs, ADSs and\/or stocks of companies from China and India currently trading on U.S. exchanges. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FONE","fund_name":"First Trust NASDAQ Smartphone Index Fund","rating":1,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ CTA Smartphone Index(SM).\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts representing securities in the index. The index is designed to track the performance of companies engaged in the Smartphone segment of the telecommunications and technology sectors.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FPA","fund_name":"First Trust Asia Pacific Ex-Japan AlphaDEX® Fund","rating":2,"morningstar_category":"Pacific\/Asia ex-Japan Stk","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® Asia Pacific Ex-Japan Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ Asia Pacific Ex-Japan Index that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FPE","fund_name":"First Trust Preferred Securities and Income ETF","rating":4,"morningstar_category":"Preferred Stock","category":"Bond","family":"First Trust","market_cap":"small","description":"The investment seeks total return and to provide current income.\\n Under normal market conditions, the fund invests at least 80% of its net assets (including investment borrowings) in preferred securities (\\\"Preferred Securities\\\") and income-producing debt securities (\\\"Income Securities\\\"). The fund invests in securities that are traded over-the-counter or listed on an exchange.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FPEI","fund_name":"First Trust Institutional Preferred Securities and Income ETF","morningstar_category":"Preferred Stock","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks total return and to provide current income.\\n The fund invests at least 80% of its net assets (including investment borrowings) in institutional preferred securities and income-producing debt securities (\\\"Income Securities\\\"). Preferred securities are a type of equity security that have preference over common stock in the payment of distributions and the liquidation of a company's assets, but are generally junior to all forms of the company's debt, including both senior and subordinated debt. The fund's investments in preferred securities will primarily be in institutional preferred securities. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FSZ","fund_name":"First Trust Switzerland AlphaDEX® Fund","morningstar_category":"Miscellaneous Region","category":"International","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ AlphaDEX® Switzerland Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is designed to select stocks from the NASDAQ Switzerland Index (the \\\"base index\\\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTAG","fund_name":"First Trust Indxx Global Agriculture ETF","rating":2,"morningstar_category":"Natural Resources","category":"Sector","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Indxx Global Agriculture Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is a market capitalization weighted index designed to measure the performance of companies that are directly or indirectly engaged in improving agricultural yields. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTGC","fund_name":"First Trust Indxx Global Agriculture ETF","rating":2,"morningstar_category":"Natural Resources","category":"Bond","family":"First Trust","market_cap":null,"description":"he investment seeks to provide total return by providing investors with commodity exposure while seeking a relatively stable risk profile.\\n The fund is an actively managed exchange-traded fund (\\\"ETF\\\") that seeks to achieve attractive risk adjusted return by investing in commodity futures contracts and exchange-traded commodity linked instruments (collectively, \\\"Commodities Instruments\\\") through a wholly-owned subsidiary of the fund organized under the laws of the Cayman Islands (the \\\"Subsidiary\\\"). The advisor expects to gain exposure to these investments exclusively by investing in the Subsidiary.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTRI","fund_name":"First Trust Indxx Global Natural Resources Income ETF","rating":2,"morningstar_category":"Natural Resources","category":"Commodity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Indxx Global Natural Resources Income Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks and\/or depositary receipts that comprise the index. The index is a 50-stock free float adjusted market capitalization weighted index designed to measure the market performance of the 50 highest dividend yielding companies involved in the upstream segment of the natural resources sector. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTSL","fund_name":"First Trust Senior Loan Fund","rating":3,"morningstar_category":"Bank Loan","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks to provide high current income; the fund's secondary investment objective is the preservation of capital.\\n Under normal market conditions, the fund seeks to outperform each of the primary index and secondary index by investing at least 80% of its net assets in first lien senior floating rate bank loans. The S&P\/LSTA U.S. Leveraged Loan 100 Index (the \\\"primary index\\\") is a market value-weighted index designed to measure the performance of the largest segment of the U.S. syndicated leveraged loan market. The Markit iBoxx USD Liquid Leveraged Loan Index (the \\\"secondary index\\\") selects the 100 most liquid Senior Loans in the market.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTSM","fund_name":"First Trust Enhanced Short Maturity ETF","rating":3,"morningstar_category":"Ultrashort Bond","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks current income, consistent with preservation of capital and daily liquidity.\\n Under normal market conditions, the Advisor intends to achieve its investment objective by investing at least 80% of its net assets in a portfolio of U.S. dollar-denominated fixed- and variable-rate instruments (collectively, \\\"Fixed Income Securities\\\") issued by U.S. and non-U.S. public and private sector entities. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXD","fund_name":"First Trust Nasdaq Retail ETF","morningstar_category":"Consumer Cyclical","category":"Sector","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of the Nasdaq US Smart Retail Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is designed to select retail stocks from the NASDAQ US Benchmark Index based on a ranking methodology of three price factors which aims to select companies that exhibit: strong growth through high average 3-, 6-, 9- and 12-month price return; value; and low expected volatility based on historical stock price fluctuation. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXG","fund_name":"First Trust Nasdaq Food & Beverage ETF","morningstar_category":"Consumer Defensive","category":"Sector","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Nasdaq US Smart Food & Beverage Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the underlying index. The underlying index is designed to select food and beverage stocks from the NASDAQ US Benchmark Index based on a ranking methodology of three price factors which aims to select companies. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXH","fund_name":"First Trust Nasdaq Pharmaceuticals ETF","morningstar_category":"Health","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of the Nasdaq US Smart Pharmaceuticals Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is designed to select pharmaceuticals stocks from the base index based on a ranking methodology of three price factors which aims to select companies that exhibit: strong growth through high average 3-, 6-, 9- and 12-month price return; value; and low expected volatility based on historical stock price fluctuation. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXL","fund_name":"First Trust Nasdaq Semiconductor ETF","morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of the Nasdaq US Smart Semiconductor Index.\\n The fund invests at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is designed to select semiconductor stocks from the NASDAQ US Benchmark Index based on a ranking methodology of three price factors which aims to select companies that exhibit: strong growth through high average 3-, 6-, 9- and 12-month price return; value; and low expected volatility based on historical stock price fluctuation. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXN","fund_name":"First Trust Nasdaq Oil & Gas ETF","morningstar_category":"Equity Energy","category":"Commodity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of the Nasdaq US Smart Oil & Gas Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is designed to select oil and gas stocks from the NASDAQ US Benchmark Index based on a ranking methodology of three price factors which aims to select companies that exhibit: strong growth through high average 3-, 6-, 9- and 12-month price return; value; and low expected volatility based on historical stock price fluctuation. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXO","fund_name":"First Trust Nasdaq Bank ETF","morningstar_category":"Financial","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Nasdaq US Smart Banks Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the underlying index. The underlying index is designed to select bank stocks from the NASDAQ US Benchmark Index based on a ranking methodology of three price factors which aims to select companies. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FTXR","fund_name":"First Trust Nasdaq Transportation ETF","morningstar_category":"Industrials","category":"Sector","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of the Nasdaq US Smart Transportation Index.\\n The fund invests at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is designed to select transportation stocks from the NASDAQ US Benchmark Index based on a ranking methodology of three price factors which aims to select companies that exhibit: strong growth through high average 3-, 6-, 9- and 12-month price return; value; and low expected volatility based on historical stock price fluctuation. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FV","fund_name":"First Trust Dorsey Wright Focus 5 ETF","rating":2,"morningstar_category":"Mid-Cap Growth","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an index called the Dorsey Wright Focus Five Index (the \\\"index\\\").\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the exchange-traded funds (\\\"ETFs\\\") that comprise the index. The index is designed to provide targeted exposure to the five First Trust sector-based ETFs that the index provider believes offer the greatest potential to outperform the other ETFs in the selection universe and that satisfy certain trading volume and liquidity requirements. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"FVL","fund_name":"First Trust Value Line® 100 Exchange-Traded Fund","rating":1,"morningstar_category":"Mid-Cap Blend","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the Value Line® 100 Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is an equal-dollar weighted index that is designed to objectively identify and select 100 stocks from the universe of stocks to which Value Line assigns a #1 ranking in the Value Line Timeliness Ranking System.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXD","fund_name":"First Trust Consumer Discretionary AlphaDEX® Fund","rating":3,"morningstar_category":"Consumer Cyclical","category":"Sector","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Consumer Discretionary Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the consumer discretionary sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXG","fund_name":"First Trust Consumer Staples AlphaDEX® Fund","rating":3,"morningstar_category":"Consumer Defensive","category":"Sector","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Consumer Staples Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the consumer staples sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXH","fund_name":"First Trust Health Care AlphaDEX® Fund","rating":4,"morningstar_category":"Health","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Health Care Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the health care sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXL","fund_name":"First Trust Technology AlphaDEX® Fund","rating":3,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Technology Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the technology sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXN","fund_name":"First Trust Energy AlphaDEX® Fund","rating":3,"morningstar_category":"Equity Energy","category":"Commodity","family":"First Trust","market_cap":"mid","description":"The investment seeks results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Energy Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the energy sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXO","fund_name":"First Trust Financials AlphaDEX® Fund","rating":5,"morningstar_category":"Financial","category":"Equity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Financials Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the financial services sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXR","fund_name":"First Trust Industrials\/Producer Durables AlphaDEX® Fund","rating":3,"morningstar_category":"Industrials","category":"Sector","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Industrials Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the industrials and producer durables sectors that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXU","fund_name":"First Trust Utilities AlphaDEX® Fund","rating":4,"morningstar_category":"Utilities","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Utilities Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the utilities sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"FXZ","fund_name":"First Trust Materials AlphaDEX® Fund","rating":4,"morningstar_category":"Natural Resources","category":"Sector","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the StrataQuant® Materials Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000® Index in the materials and processing sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEX® selection methodology.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GAL","fund_name":"SPDR® SSgA Global Allocation ETF","rating":2,"morningstar_category":"Allocation--50% to 70% Equity","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide capital appreciation.\\n The Adviser primarily invests the assets of the fund among exchange traded products (\\\"ETPs\\\") that provide balanced exposure to domestic and international debt and equity securities. The fund typically allocates approximately 60% of its assets to equity securities, though this percentage can vary based on the Adviser's tactical decisions.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GII","fund_name":"SPDR® S&P Global Infrastructure ETF","rating":2,"morningstar_category":"Infrastructure","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Global Infrastructure Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is comprised of 75 of the largest publicly listed infrastructure companies that meet specific investability requirements. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GLDM","fund_name":"SPDR® Gold MiniShares","morningstar_category":"Commodities Precious Metals","category":"Commodity","family":"SPDR","market_cap":null,"description":"The investment seeks to reflect the performance of the price of gold bullion, less the expenses of operations.\\nThe Shares are designed for investors who want a cost-effective and convenient way to invest in gold. Advantages of investing in the Shares include ease and flexibility of investment and expenses.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GMF","fund_name":"SPDR® S&P Emerging Asia Pacific ETF","rating":3,"morningstar_category":"Pacific\/Asia ex-Japan Stk","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Asia Pacific Emerging BMI Index based upon the emerging markets of the Asia Pacific region.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts (including ADRs or GDRs) based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in emerging Asian Pacific markets. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GNR","fund_name":"SPDR® S&P Global Natural Resources ETF","rating":4,"morningstar_category":"Natural Resources","category":"Commodity","family":"SPDR","market_cap":"large","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Global Natural Resources Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is comprised of 90 of the largest U.S. and foreign publicly traded companies, based on market capitalization, in natural resources and commodities businesses that meet certain investability requirements. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GOVT","fund_name":"iShares U.S. Treasury Bond ETF","rating":3,"morningstar_category":"Intermediate Government","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the ICE U.S. Treasury Core Bond Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the index. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity greater than one year and less than or equal to thirty years.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"GRID","fund_name":"First Trust NASDAQ® Clean Edge® Smart Grid Infrastructure Index Fund","rating":1,"morningstar_category":"Miscellaneous Sector","category":"Equity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ OMX® Clean Edge® Smart Grid Infrastructure IndexSM.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts representing securities in the index. The index includes companies that are primarily engaged and involved in electric grid, electric meters and devices, networks, energy storage and management, and enabling software used by the smart grid infrastructure sector. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"GSD","fund_name":"WisdomTree Global SmallCap Dividend Fund","rating":4,"morningstar_category":"World Small\/Mid Stock","category":"Equity","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance of the WisdomTree Global SmallCap Dividend Index.\\n The fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that consists of small-capitalization companies selected from the WisdomTree Global Dividend Index, which defines the dividend-paying universe of companies in the United States, developed countries, and emerging markets throughout the world. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"GULF","fund_name":"WisdomTree Middle East Dividend Fund","rating":5,"morningstar_category":"Miscellaneous Region","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Middle East Dividend Index.\\n Under normal circumstances, at least 95% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of companies in the Middle East region that pay regular cash dividends on shares of common stock. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"GWX","fund_name":"SPDR® S&P International Small Cap ETF","rating":3,"morningstar_category":"Foreign Small\/Mid Blend","category":"International","family":"SPDR","market_cap":"small","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Developed Ex-U.S. under USD2 Billion Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded small-cap companies, as defined by the index, domiciled in developed countries outside the United States. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"GXC","fund_name":"SPDR® S&P China ETF","rating":4,"morningstar_category":"China Region","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P China BMI Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in China available to foreign investors. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HDG","fund_name":"ProShares Hedge Replication ETF","rating":3,"morningstar_category":"Multialternative","category":"Equity","family":"ProShares","market_cap":"large","description":"The investment seeks investment results, before fees and expenses, that track the performance of the Merrill Lynch Factor Model-Exchange Series (the \\\"benchmark\\\").\\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should track the performance of the benchmark. The benchmark seeks to provide the risk and return characteristics of the hedge fund asset class by targeting a high correlation to the HFRI Fund Weighted Composite Index (the \\\"HFRI\\\"). The HFRI is designed to reflect hedge fund industry performance through an equally weighted composite of over 2000 constituent funds. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HDMV","fund_name":"First Trust Horizon Managed Volatility Developed International ETF","morningstar_category":"Foreign Large Blend","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks to provide capital appreciation.\\n Under normal market conditions, the fund seeks to achieve its investment objective by investing at least 80% of its net assets (including investment borrowings) in common stocks and depositary receipts of developed market companies listed and traded on non-U.S. exchanges that the Sub-Advisor believes exhibit low future expected volatility. Under normal market conditions, it will invest in at least three countries and at least 40% of its net assets in countries other than the United States. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HEDJ","fund_name":"WisdomTree Europe Hedged Equity Fund","rating":5,"morningstar_category":"Europe Stock","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Hedged Equity Index.\\n The fund invests at least 95% of its total assets (exclusive of collateral held from securities lending) in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index provides exposure to European equity securities, particularly shares of European exporters, while at the same time neutralizing exposure to fluctuations between the value of the U.S. dollar and the euro. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HEWJ","fund_name":"iShares Currency Hedged MSCI Japan ETF","rating":2,"morningstar_category":"Japan Stock","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Japan 100% Hedged to USD Index.\\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index consists of stocks traded primarily on the Tokyo Stock Exchange with the currency risk inherent in the securities included in the underlying index hedged to the U.S. dollar on a monthly basis.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HEWW","fund_name":"iShares Currency Hedged MSCI Mexico ETF","morningstar_category":"Miscellaneous Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Mexico IMI 25\/50 100% Hedged to USD Index.\\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the index. The index consists of stocks traded primarily on the Mexican Stock Exchange with the currency risk inherent in the securities included in the index hedged to the U.S. dollar on a monthly basis.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HEZU","fund_name":"iShares Currency Hedged MSCI Eurozone ETF","rating":4,"morningstar_category":"Europe Stock","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI EMU 100% Hedged to USD Index.\\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is an equity benchmark for the Economic and Monetary Union countries with the currency risk inherent in the securities included in the underlying index hedged to the U.S. dollar on a monthly basis.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HGSD","fund_name":"WisdomTree Global Hedged SmallCap Dividend Fund","rating":4,"morningstar_category":"World Small\/Mid Stock","category":"Equity","family":"WisdomTree","market_cap":"small","description":"The investment seeks to track the price and yield performance of the WisdomTree Global Hedged SmallCap Dividend Index.\\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index designed to provide exposure to small-capitalization companies selected from the WisdomTree Global Dividend Index. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"HYLS","fund_name":"First Trust Tactical High Yield ETF","rating":3,"morningstar_category":"High Yield Bond","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks current income; capital appreciation is the secondary objective.\\n Under normal market conditions, the fund invests at least 80% of its net assets (including investment borrowings) in high yield debt securities that are rated below investment grade at the time of purchase or unrated securities deemed by the fund's advisor to be of comparable quality.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"HYMB","fund_name":"SPDR® Nuveen S&P High Yield Municipal Bond ETF","rating":3,"morningstar_category":"High Yield Muni","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the S&P Municipal Yield Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Sub-Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index tracks the U.S. high yield municipal bond market and to provide income that is exempt from federal income taxes. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"HYND","fund_name":"WisdomTree Negative Duration High Yield Bond Fund","rating":2,"morningstar_category":"Nontraditional Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the ICE BofA Merrill Lynch 0-5 Year U.S. High Yield Constrained, Negative Seven Duration Index.\\n The index is designed to provide long exposure to the ICE BofA Merrill Lynch 0-5 Year US High Yield Constrained Index while seeking to manage interest rate risk through the use of short positions in U.S. Treasury securities. The fund normally invests at least 80% of its total assets in the component securities of the index and investments that have economic characteristics that are substantially identical to such component securities. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"HYZD","fund_name":"WisdomTree Interest Rate Hedged High Yield Bond Fund","rating":4,"morningstar_category":"Nontraditional Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance of the ICE BofA Merrill Lynch 0-5 Year U.S. High Yield Constrained, Zero Duration Index.\\n The index is designed to provide long exposure to the ICE BofA Merrill Lynch 0-5 Year U.S. High Yield Constrained Index while seeking to manage interest rate risk through the use of short positions in U.S. Treasury securities. Normally, at least 80% of the fund's total assets will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"IAGG","fund_name":"iShares Core International Aggregate Bond ETF","rating":4,"morningstar_category":"World Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Bloomberg Barclays Global Aggregate ex USD 10% Issuer Capped (Hedged) Index composed of global non-U.S. dollar-denominated investment-grade bonds that mitigates exposure to fluctuations between the value of the component currencies and the U.S. dollar.\\n The fund generally will invest at least 90% of its assets in the component securities and other instruments of the underlying index. The index measures the performance of the global investment-grade bond market. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"IBND","fund_name":"SPDR® Bloomberg Barclays International Corporate Bond ETF","rating":1,"morningstar_category":"World Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays Global Aggregate ex-USD >$1B: Corporate Bond Index.\\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to be a broad based measure of the global investment grade, fixed rate, fixed income corporate markets outside the United States. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ICOL","fund_name":"iShares MSCI Colombia ETF","morningstar_category":"Miscellaneous Region","category":"International","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the MSCI All Colombia Capped Index composed of Colombian equities.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to represent the performance of the broad Colombia equity universe. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IDMO","fund_name":"Invesco S&P International Developed Momentum ETF","rating":1,"morningstar_category":"Foreign Large Blend","category":"International","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the S&P Momentum Developed ex-U.S. & South Korea LargeMidCap IndexTM (the \\\"underlying index\\\").\\n The fund will invest at least 90% of its total assets in the securities of companies that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is composed of constituents of the S&P Developed ex-U.S. & South Korea LargeMidCap Index that have the highest \\\"momentum score.\\\"","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IEUR","fund_name":"iShares Core MSCI Europe ETF","rating":3,"morningstar_category":"Europe Stock","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Europe IMI.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index which consists of securities from the following 15 developed market countries or regions: Austria, Belgium, Denmark, Finland, France, Germany, Ireland, Italy, the Netherlands, Norway, Portugal, Spain, Sweden, Switzerland and the United Kingdom.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IFGL","fund_name":"iShares International Developed Real Estate ETF","rating":2,"morningstar_category":"Global Real Estate","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the FTSE EPRA Nareit Developed ex-U.S. Index composed of real estate equities in developed non-U.S. markets.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index measures the stock performance of companies engaged in the ownership and development of real estate markets in developed countries (except for the United States) as defined by FTSE EPRA\/NAREIT.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"IHDG","fund_name":"WisdomTree International Hedged Quality Dividend Growth Fund","rating":3,"morningstar_category":"Foreign Large Growth","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance of the WisdomTree International Hedged Quality Dividend Growth Index.\\n The fund will invest at least 80% of its total assets in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks with growth characteristics of companies in the industrialized world, excluding Canada and the U.S., while at the same time neutralizing exposure to fluctuations of the value of foreign currencies relative to the USD. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ILTB","fund_name":"iShares Core 10+ Year USD Bond ETF","rating":3,"morningstar_category":"Long-Term Bond","category":"Equity","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Bloomberg Barclays U.S. Universal 10+ Year Index (the \\\"underlying index\\\").\\n The underlying index measures the performance of U.S. dollar-denominated taxable bonds that are rated either investment-grade or high yield with remaining maturities greater than ten years. The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IMTM","fund_name":"iShares Edge MSCI Intl Momentum Factor ETF","rating":3,"morningstar_category":"Foreign Large Growth","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI World ex USA Momentum Index that measures the performance of international developed large- and mid-capitalization stocks exhibiting relatively higher momentum characteristics.\\n The fund will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index. The index consists of stocks exhibiting relatively higher momentum characteristics than the traditional market capitalization-weighted parent index, the MSCI World ex USA Index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IPAC","fund_name":"iShares Core MSCI Pacific ETF","rating":3,"morningstar_category":"Diversified Pacific\/Asia","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI Pacific IMI (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index which consists of securities from the following five countries or regions: Australia, Hong Kong, Japan, New Zealand and Singapore.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IPE","fund_name":"SPDR® Bloomberg Barclays TIPS ETF","rating":4,"morningstar_category":"Inflation-Protected Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Government Inflation-Linked Bond Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the inflation protected public obligations of the U.S. Treasury, commonly known as \\\"TIPS.\\\" It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IPFF","fund_name":"iShares International Preferred Stock ETF","rating":1,"morningstar_category":"Preferred Stock","category":"Equity","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the S&P International Preferred Stock IndexTM.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of a select group of preferred stocks from non-U.S. developed market issuers and traded on non-U.S. developed market exchanges as defined by the index provider. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"IPKW","fund_name":"Invesco International BuyBack Achievers™ ETF","rating":5,"morningstar_category":"Foreign Large Blend","category":"International","family":"Invesco","market_cap":"mid","description":"The investment seeks to track the investment results (before fees and expenses) of the NASDAQ International BuyBack AchieversTM Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in common stocks that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the Nasdaq, Inc. includes in the underlying index common stocks of foreign companies that are classified as \\\"International BuyBack AchieversTM\\\" pursuant to a proprietary selection methodology. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"IQDG","fund_name":"WisdomTree International Quality Dividend Growth Fund","morningstar_category":"Foreign Large Growth","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International Quality Dividend Growth Index.\\n Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks with growth characteristics of companies in the industrialized world, excluding Canada and the United States. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"IQLT","fund_name":"iShares Edge MSCI Intl Quality Factor ETF","rating":4,"morningstar_category":"Foreign Large Blend","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI World ex USA Sector Neutral Quality Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index measures the performance of international developed large- and mid-capitalization stocks exhibiting relatively higher quality characteristics as identified through three fundamental variables: return on equity, earnings variability and debt-to-equity.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ITE","fund_name":"SPDR® Bloomberg Barclays Intermediate Term Treasury ETF","rating":2,"morningstar_category":"Intermediate Government","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays 3-10 Year U.S. Treasury Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of intermediate term (3-10 years) public obligations of the U.S. Treasury. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"IYLD","fund_name":"iShares Morningstar Multi-Asset Income ETF","rating":5,"morningstar_category":"Allocation--30% to 50% Equity","category":"Equity","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the Morningstar® Multi-Asset High Income IndexSM.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is broadly diversified and seeks to deliver high current income while maintaining long-term capital appreciation. The fund is a fund-of-funds and invests primarily in the securities of the underlying funds that themselves seek investment results corresponding to their own underlying indexes.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"JPGB","fund_name":"JPMorgan Global Bond Opportunities ETF","morningstar_category":"Multisector Bond","category":"Equity","family":"JPMorgan","market_cap":null,"description":"The investment seeks to provide total return.\\n Under normal circumstances, the fund will invest at least 80% of its assets in bonds. It will invest at least 40% of its assets in countries other than the United States. The fund may invest in developed or emerging markets. It generally invests at least 25% of its assets in securities that, at the time of purchase are rated investment grade or the unrated equivalent. \\\"Assets\\\" means net assets plus the amount of borrowings for investment purposes. The fund may also use currency related transactions involving currency derivatives as part of its primary investment strategy.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"JPGE","fund_name":"JPMorgan Diversified Return Global Equity ETF","rating":3,"morningstar_category":"World Large Stock","category":"Equity","family":"JPMorgan","market_cap":"large","description":"The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the JP Morgan Diversified Factor Global Developed Equity Index.\\n The index is comprised of equity securities across developed global markets selected to represent a diversified set of factor characteristics: value, price momentum and quality. The fund will invest at least 80% of its net assets in securities included in the index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"JPHF","fund_name":"JPMorgan Diversified Alternative ETF","morningstar_category":"Multialternative","category":"Equity","family":"JPMorgan","market_cap":"mid","description":"The investment seeks to provide long-term total return.\\n The fund will seek to achieve its investment objective by allocating assets across several different investment strategies, including traditional and alternative investment strategies, such as those utilized by certain hedge funds. The strategies identified by the adviser for the fund fall into the following broad categories: Equity Long\/Short, Event Driven and Macro\/Managed Futures strategies. The fund will invest its assets based on a systematic investment process for securities selection and asset allocation.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"JPHY","fund_name":"JPMorgan Disciplined High Yield ETF","morningstar_category":"High Yield Bond","category":"Bond","family":"JPMorgan","market_cap":null,"description":"The investment seeks a high level of income; capital appreciation is a secondary objective.\\n The fund invests primarily in high yield, high risk debt securities. Under normal circumstances, it invests at least 80% of its assets in high yield securities. For purposes of this policy, \\\"assets\\\" means net assets plus the amount of borrowings for investment purposes. The fund may invest up to 100% of its total assets in below investment grade or unrated securities. The adviser uses a multi-factor security selection process that uses factors that the adviser believes reflect liquidity and issuer quality.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"JPST","fund_name":"JPMorgan Ultra-Short Income ETF","morningstar_category":"Ultrashort Bond","category":"Bond","family":"JPMorgan","market_cap":null,"description":"The investment seeks to provide current income while seeking to maintain a low volatility of principal.\\n Under normal circumstances, the fund seeks to achieve its investment objective by investing at least 80% of its Assets in investment grade, U.S. dollar denominated short-term fixed, variable and floating rate debt. \\\"Assets\\\" means net assets, plus the amount of borrowings for investment purposes. As part of its principal investment strategy, it may invest in corporate securities, asset-backed securities, mortgage-backed and mortgage-related securities, and high quality money market instruments such as commercial paper and certificates of deposit.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"KBE","fund_name":"SPDR® S&P Bank ETF","rating":1,"morningstar_category":"Financial","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Banks Select Industry Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index tracks the performance of publicly traded national money centers and leading regional banks. It may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments, such as repurchase agreements and money market funds. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"KIE","fund_name":"SPDR® S&P Insurance ETF","rating":5,"morningstar_category":"Financial","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index that tracks the performance of publicly traded companies in the insurance industry.\\n In seeking to track the performance of the S&P Insurance Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the insurance segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"LALT","fund_name":"Invesco Multi-Strategy Alternative ETF","rating":2,"morningstar_category":"Multialternative","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks a positive total return that has a low correlation to the broader securities markets.\\n The fund is an actively managed exchange-traded fund (\\\"ETF\\\") that seeks to achieve its investment objective by investing in a combination of equity securities, financial futures contracts, forward currency contracts and other securities. The sub-adviser selects investments for inclusion in the fund's portfolio with reference to the components of the Morgan Stanley Multi-Strategy Alternative Index (the \\\"Benchmark\\\") through a quantitative process that seeks to exceed the Benchmark's performance.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"LEMB","fund_name":"iShares J.P. Morgan EM Local Currency Bond ETF","rating":3,"morningstar_category":"Emerging-Markets Local-Currency Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the J.P. Morgan GBI-EM Global Diversified 15% Cap 4.5% Floor Index composed of local currency denominated, emerging market sovereign bonds.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates. The index tracks the performance of local currency-denominated sovereign bond markets of emerging market countries. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"LGLV","fund_name":"SPDR® SSGA US Large Cap Low Volatility Index ETF","rating":5,"morningstar_category":"Large Blend","category":"Bond","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA US Large Cap Low Volatility Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of the stocks of U.S. large capitalization companies that exhibit low volatility. Volatility is a statistical measurement of the magnitude of movements in a stock's price over time. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"LMBS","fund_name":"First Trust Low Duration Opportunities ETF","rating":5,"morningstar_category":"Short-Term Bond","category":"Bond","family":"First Trust","market_cap":null,"description":"The investment seeks to generate current income with a secondary objective of capital appreciation.\\n Under normal market conditions, the fund will seek to achieve its investment objectives by investing at least 80% of its net assets (including investment borrowings) in mortgage-related debt securities and other mortgage-related instruments (collectively, \\\"Mortgage-Related Investments\\\"). The advisor normally expects to invest in Mortgage-Related Investments tied to residential and commercial mortgages. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"LOWC","fund_name":"SPDR® MSCI ACWI Low Carbon Target ETF","rating":3,"morningstar_category":"World Large Stock","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the MSCI ACWI Low Carbon Target Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to address two dimensions of carbon exposure - carbon emissions and fossil fuel reserves, expressed as potential emissions. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"MBG","fund_name":"SPDR® Bloomberg Barclays Mortgage Backed Bond ETF","rating":4,"morningstar_category":"intermediate Government","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. MBS Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the U.S. agency mortgage pass-through segment of the U.S. investment grade bond market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"MCEF","fund_name":"First Trust Municipal CEF Income Opportunity ETF","morningstar_category":"Muni National Interm","category":"Bond","family":"First Trust","market_cap":"large","description":"The investment seeks to provide current income.\\n Under normal market conditions, the fund seeks to achieve its investment objective by investing at least 80% of its net assets (including investment borrowings) in a portfolio of closed-end investment companies that are listed and traded in the United States on registered exchanges which invest primarily in municipal debt securities, some or all of which pay interest that is exempt from regular federal income taxes. It may also invest in exchange-traded funds (\\\"ETFs\\\"). The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"MCHI","fund_name":"iShares MSCI China ETF","rating":4,"morningstar_category":"China Region","category":"International","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI China Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the performance of equity securities in the top 85% in market capitalization of the Chinese equity securities markets, as represented by the H-Shares and B-Shares markets. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"MDYG","fund_name":"SPDR® S&P 400 Mid Cap Growth ETF","rating":4,"morningstar_category":"Mid-Cap Growth","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P MidCap 400 Growth Index that tracks the performance of medium capitalization exchange traded U.S. equity securities exhibiting \\\"growth\\\" characteristics.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the mid-capitalization growth segment of the U.S. equity market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"MDYV","fund_name":"SPDR® S&P 400 Mid Cap Value ETF","rating":4,"morningstar_category":"Mid-Cap Value","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P MidCap 400 Value Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the mid-capitalization value segment of the U.S. equity market. It may purchase a subset of the securities in the index in an effort to hold a portfolio of securities with generally the same risk and return characteristics of the index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"MEAR","fund_name":"iShares Short Maturity Municipal Bond ETF","rating":3,"morningstar_category":"Muni National Short","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to maximize tax-free current income.\\n The fund normally invests at least 80% of its net assets in municipal securities such that the interest on each bond is exempt from U.S. federal income taxes and the federal alternative minimum tax (\\\"AMT\\\"). It primarily invests in U.S. dollar-denominated investment-grade short-term fixed- and floating-rate municipal securities with remaining maturities of five years or less, such as municipal bonds, municipal notes and variable rate demand obligations, as well as money market instruments and registered investment companies. The fund is an actively managed exchange-traded fund (\\\"ETF\\\").","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"MOM","fund_name":"AGFiQ U.S. Market Neutral Momentum Fund","rating":2,"morningstar_category":"Market Neutral","category":"Equity","family":"AGFiQ","market_cap":"mid","description":"The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Momentum Index.\\n The fund invests at least 80% of its net assets in common stock of the long positions in the underlying index and sell short at least 80% of the short positions in the underlying index. The index is a long\/short market neutral index that is dollar-neutral. As such, it identifies long and short securities positions of approximately equal dollar amounts. In choosing to track a market neutral index, the fund seeks to limit the effects of general market movements on the fund.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"MRGR","fund_name":"ProShares Merger ETF","rating":3,"morningstar_category":"Market Neutral","category":"Equity","family":"ProShares","market_cap":"mid","description":"The investment seeks investment results, before fees and expenses, that track the performance of the S&P® Merger Arbitrage Index (the \\\"index\\\").\\n The fund is designed to track the performance of the index and provide exposure to a global merger arbitrage strategy. The index, and by extension the fund, seeks to produce consistent, positive returns in virtually all market environments, although there are no assurances it will achieve this result. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"MTUM","fund_name":"iShares Edge MSCI USA Momentum Factor ETF","rating":5,"morningstar_category":"Large Growth","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI USA Momentum Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index consists of stocks exhibiting relatively higher momentum characteristics than the traditional market capitalization-weighted parent index, the MSCI USA Index, which includes U.S. large- and mid-capitalization stocks.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"MUB","fund_name":"iShares National Muni Bond ETF","rating":3,"morningstar_category":"Muni National Interm","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the S&P National AMT-Free Municipal Bond IndexTM.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of the investment-grade segment of the U.S. municipal bond market.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"NEAR","fund_name":"iShares Short Maturity Bond ETF","rating":4,"morningstar_category":"Ultrashort Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to maximize current income.\\n The fund seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in a portfolio of U.S. dollar-denominated investment-grade fixed-income securities. Under normal circumstances, the effective duration of its portfolio is expected to be one year or less, as calculated by the management team. It is an actively managed exchange-traded fund (\\\"ETF\\\") that does not seek to replicate the performance of a specified index. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"OILK","fund_name":"ProShares K-1 Free Crude Oil Strategy ETF","morningstar_category":"Commodities Energy","category":"Commodity","family":"ProShares","market_cap":null,"description":"The investment seeks to provide total return through actively managed exposure to the West Texas Intermediate crude oil futures markets.\\n The fund's strategy seeks to outperform certain index based strategies by actively managing the rolling of WTI crude oil futures contracts. The fund generally will not invest directly in WTI crude oil futures. The advisor expects to gain exposure to these investments by investing a portion of its assets in the ProShares Cayman Crude Oil Strategy Portfolio, a wholly-owned subsidiary of the fund organized under the laws of the Cayman Islands. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"ONEO","fund_name":"SPDR® Russell 1000 Momentum Focus ETF","rating":3,"morningstar_category":"Mid-Cap Blend","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Russell 1000 Momentum Focused Factor Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to reflect the performance of a segment of large-capitalization U.S. equity securities demonstrating a combination of core factors (high value, high quality, and low size characteristics), with a focus factor comprising high momentum characteristics. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ONEV","fund_name":"SPDR® Russell 1000 Low Volatility Focus ET","rating":5,"morningstar_category":"Mid-Cap Blend","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Russell 1000 Low Volatility Focused Factor Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to reflect the performance of a segment of large-capitalization U.S. equity securities demonstrating a combination of core factors (high value, high quality, and low size characteristics), with a focus factor comprising low volatility characteristics. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ONEY","fund_name":"SPDR® Russell 1000® Yield Focus ETF","rating":5,"morningstar_category":"Mid-Cap Value","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Russell 1000 Yield Focused Factor Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to reflect the performance of a segment of large-capitalization U.S. equity securities demonstrating a combination of core factors (high value, high quality, and low size characteristics), with a focus factor comprising high yield characteristics (the \\\"Factor Characteristics\\\"). It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PCEF","fund_name":"Invesco CEF Income Composite ETF","rating":4,"morningstar_category":"Allocation--30% to 50% Equity","category":"Bond","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the S-Network Composite Closed-End Fund IndexSM.\\n The fund generally invests at least 90% of its total assets in securities of U.S.-listed closed-end funds that comprise the underlying index. It is a \\\"fund of funds,\\\" as it invests its assets in the common shares of funds included in the underlying index rather than in individual securities (the \\\"underlying funds\\\").","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PDBC","fund_name":"Invesco Optimum Yield Diversified Commodity Strategy No K-1 ETF","rating":4,"morningstar_category":"Commodities Broad Basket","category":"Equity","family":"Invesco","market_cap":null,"description":"The investment seeks long term capital appreciation.\\n The fund is an actively managed exchange-traded fund (\\\"ETF\\\") that seeks to achieve its investment objective by investing in a combination of financial instruments that are economically linked to the world's most heavily traded commodities. Commodities are assets that have tangible properties, such as oil, agricultural produce or raw metals. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"PDP","fund_name":"Invesco DWA Momentum ETF","rating":3,"morningstar_category":"Mid-Cap Growth","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the Dorsey Wright® Technical Leaders Index.\\n The fund generally will invest at least 90% of its total assets in securities that comprise the underlying index. The underlying index is composed of approximately 100 securities from an eligible universe of approximately 1,000 securities of the largest constituents by market capitalization within the NASDAQ US Benchmark Index.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"PEX","fund_name":"ProShares Global Listed Private Equity ETF","morningstar_category":"Miscellaneous Sector","category":"Equity","family":"ProShares","market_cap":"small","description":"The investment seeks investment results, before fees and expenses, that track the performance of the LPX Direct Listed Private Equity Index (the \\\"index\\\").\\n The index consists of up to 30 qualifying listed private equity companies. The fund invests in securities that ProShare Advisors believes, in combination, should track the performance of the index. It will invest at least 80% of its total assets in component securities. The fund will concentrate its investments in a particular industry or group of industries, country or region to approximately the same extent as the index is so concentrated. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"PFIG","fund_name":"Invesco Fundamental Investment Grade Corporate Bond ETF","rating":2,"morningstar_category":"Corporate Bond","category":"Bond","family":"Invesco","market_cap":null,"description":"The investment seeks to track the investment results (before fees and expenses) of the RAFI® Bonds U.S. Investment Grade 1-10 Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 80% of its total assets in the securities that comprise the underlying index. The underlying index is comprised of U.S. dollar-denominated investment grade corporate bonds which are SEC-registered securities or Rule 144A securities with registration rights (issued after July 31, 2013) and whose issuers are public companies listed on a major U.S. stock exchange.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PGF","fund_name":"Invesco Financial Preferred ETF","rating":3,"morningstar_category":"Preferred Stock","category":"Equity","family":"Invesco","market_cap":null,"description":"The investment seeks to track the investment results (before fees and expenses) of the Wells Fargo® Hybrid and Preferred Securities Financial Index.\\n The fund generally will invest at least 90% of its total assets in preferred securities of financial institutions that comprise the underlying index. The underlying index is a market capitalization weighted index designed to track the performance of preferred securities and securities that the index provider believes are functionally equivalent to preferred securities, including, but not limited to, depositary preferred securities, perpetual subordinated debt and certain capital securities. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PJP","fund_name":"Invesco Dynamic Pharmaceuticals ETF","rating":3,"morningstar_category":"Health","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the Dynamic Pharmaceutical IntellidexSM Index.\\n The fund generally will invest at least 90% of its total assets in common stocks of pharmaceutical companies that comprise the underlying intellidex. The underlying intellidex was composed of common stocks of 23 U.S. pharmaceuticals companies. These companies are engaged principally in the research, development, manufacture, sale or distribution of pharmaceuticals and drugs of all types. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PRF","fund_name":"Invesco FTSE RAFI US 1000 ETF","rating":4,"morningstar_category":"Large Value","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the FTSE RAFI™ US 1000 Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in common stocks that comprise the underlying index. The underlying index is composed of 1,000 common stocks that FTSE International Limited and Research Affiliates LLC strictly in accordance with their guidelines and mandated procedures, include to track the performance of the largest U.S. companies based on the following four fundamental measures: book value, cash flow, sales and dividends.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PRFZ","fund_name":"Invesco FTSE RAFI US 1500 Small-Mid ETF","rating":5,"morningstar_category":"Small Blend","category":"Equity","family":"Invesco","market_cap":"small","description":"The investment seeks to track the investment results (before fees and expenses) of the FTSE RAFI™ US Mid Small 1500 Index.\\n The fund generally will invest at least 90% of its total assets in common stocks that comprise the underlying index. The underlying index is composed of 1,500 common stocks that the index provider strictly in accordance with its guidelines and mandated procedures, include to track the performance of small- and medium-sized U.S. companies based on the following four fundamental measures of firm size: book value, cash flow, sales and dividends.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"PSK","fund_name":"SPDR® Wells Fargo Preferred Stock ETF","rating":3,"morningstar_category":"Preferred Stock","category":"Equity","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index.\\n In seeking to track the performance of Wells Fargo Hybrid and Preferred Securities Aggregate Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is a modified market capitalization weighted index designed to measure the performance of non-convertible preferred stock and securities that are functionally equivalent to preferred stock. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PSMB","fund_name":"Invesco Balanced Multi-Asset Allocation ETF","morningstar_category":"Allocation--50% to 70% Equity","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to provide current income and capital appreciation.\\n The fund seeks to achieve its investment objective by allocating its assets using a balanced investment style that seeks to maximize the benefits of diversification, which focuses on investing portion of fund assets both in underlying ETFs that invest in fixed-income securities (\\\"Fixed Income ETFs\\\") as well as in underlying ETFs that invest primarily in equity securities (\\\"Equity ETFs\\\"). Specifically, the fund's target allocation is to invest approximately 45%-75% of its total assets in Equity ETFs and approximately 25%-55% of its total assets in Fixed Income ETFs. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"PSMC","fund_name":"Invesco Conservative Multi-Asset Allocation ETF","morningstar_category":"Allocation--30% to 50% Equity","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks total return consistent with a lower level of risk relative to the broad stock market.\\n The fund seeks to achieve its investment objective by allocating its assets using a conservative investment style that seeks to maximize the benefits of diversification, which focuses on investing a greater portion of fund assets in Fixed Income ETFs, but also provides some exposure to underlying ETFs that invest primarily in Equity ETFs. Specifically, the fund's target allocation is to invest approximately 5%-35% of its total assets in Equity ETFs and approximately 65%-95% of its total assets in Fixed Income ETFs. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"PSMG","fund_name":"Invesco Growth Multi-Asset Allocation ETF","morningstar_category":"Allocation--70% to 85% Equity","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to provide long-term capital appreciation.\\n The fund seeks to achieve its investment objective by allocating its assets using a growth investment style that seeks to maximize the benefits of diversification, which focuses on investing a greater portion of fund assets in Equity ETFs, but also provides some exposure to Fixed Income ETFs. Specifically, the fund's target allocation is to invest approximately 65%-95% of its total assets in Equity ETFs and approximately 5%-35% of its total assets in Fixed Income ETFs. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"PSMM","fund_name":"Invesco Moderately Conservative Multi-Asset Allocation ETF","morningstar_category":"Allocation--30% to 50% Equity","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to provide current income and some capital appreciation.\\n The fund seeks to achieve its investment objective by allocating its assets using a moderately conservative investment style that seeks to maximize the benefits of diversification, which focuses on investing a greater portion of fund assets in Fixed Income ETFs, but also provides some exposure to Equity ETFs. Specifically, the fund's target allocation is to invest approximately 25%-55% of its total assets in Equity ETFs and approximately 45%-75% of its total assets in Fixed Income ETFs. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"PUTW","fund_name":"WisdomTree CBOE S&P 500 PutWrite Strategy Fund","morningstar_category":"Options-based","category":"Equity","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the CBOE S&P 500 PutWrite Index (the \\\"index\\\").\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index tracks the value of a cash-secured put option sales strategy, which consists of selling (or \\\"writing\\\") S&P 500 Index put options (\\\"SPX Puts\\\") and investing the sale proceeds in one- and three-month Treasury bills. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PXH","fund_name":"Invesco FTSE RAFI Emerging Markets ETF","rating":2,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the FTSE RAFI Emerging Markets Index (the \\\"underlying index\\\").\\n The fund will invest at least 90% of its total assets in securities of companies domiciled in countries that are classified as emerging markets within the country classification definition of FTSE International Limited that comprise the underlying index, as well as ADRs and GDRs that are based on the securities in the underlying index. The underlying index is designed to track the performance of securities of companies domiciled in emerging market countries with the highest ranking cumulative score.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"PZA","fund_name":"Invesco National AMT-Free Municipal Bond ETF","rating":4,"morningstar_category":"Muni National Long","category":"Bond","family":"Invesco","market_cap":null,"description":"The investment seeks to track the investment results (before fees and expenses) of the ICE BofAML National Long-Term Core Plus Municipal Securities Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 80% of its total assets in municipal securities that comprise the underlying index and that also are exempt from the federal alternative minimum tax (\\\"AMT\\\"). The underlying index is composed of U.S. dollar-denominated, investment grade, tax-exempt debt publicly issued by U.S. states and territories or their political subdivisions, in the U.S. domestic market with a term of at least 15 years remaining to final maturity.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"QABA","fund_name":"First Trust NASDAQ® ABA Community Bank Index Fund","rating":3,"morningstar_category":"Financial","category":"Equity","family":"First Trust","market_cap":"small","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ OMX® ABA Community Bank IndexSM.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a market-capitalization-weighted index.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"QCLN","fund_name":"First Trust NASDAQ® Clean Edge® Green Energy Index Fund","rating":2,"morningstar_category":"Miscellaneous Sector","category":"Equity","family":"First Trust","market_cap":"mid","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ® Clean Edge® Green Energy IndexSM.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is a modified market capitalization-weighted index designed to track the performance of companies whose securities are listed on NASDAQ, NYSE MKT or NYSE that are primarily manufacturers, developers, distributors or installers of clean-energy technologies. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"QEFA","fund_name":"SPDR® MSCI EAFE StrategicFactors ETF","rating":4,"morningstar_category":"Foreign Large Blend","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to track the performance of the MSCI EAFE Factor Mix A-Series Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index captures large- and mid-cap representation across 21 developed market Europe, Australasia, and Far East countries and aims to represent the performance of value, low volatility, and quality factor strategies. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"QEMM","fund_name":"SPDR® MSCI Emerging Markets StrategicFactors ETF","rating":3,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks to track the performance of the MSCI Emerging Markets (EM) Factor Mix A-Series Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index captures large- and mid-cap representation across 23 emerging markets countries and aims to represent the performance of value, low volatility, and quality factor strategies. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"QTEC","fund_name":"First Trust NASDAQ-100-Technology Sector Index Fund","rating":4,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ-100 Technology Sector IndexSM.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks that comprise the index. The index is an equal-weighted index based on the securities of the NASDAQ-100 Index® that are classified as \\\"technology\\\" according to the Industry Classification Benchmark classification system.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"QUAL","fund_name":"iShares Edge MSCI USA Quality Factor ETF","rating":4,"morningstar_category":"Large Blend","category":"Equity","family":"iShares","market_cap":"large","description":"The investment seeks to track the investment results of the MSCI USA Sector Neutral Quality Index composed of U.S. large- and mid-capitalization stocks with quality characteristics as identified through certain fundamental metrics.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is based on a traditional market capitalization-weighted parent index, the MSCI USA Index.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"QUS","fund_name":"SPDR® MSCI USA StrategicFactors ETF","rating":5,"morningstar_category":"Large Blend","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to track the performance of the MSCI USA Factor Mix A-Series Capped Index.\\n The fund invests at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the equity market performance of large-and mid-cap companies across the U.S. equity market. It aims to represent the performance of a combination of three factors: value, quality, and low volatility. It is an equal weighted combination of the following three MSCI Factor Indices in a single composite index: the MSCI USA Value Weighted Index, the MSCI USA Quality Index, and the MSCI USA Minimum Volatility Index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"RALS","fund_name":"ProShares RAFI® Long\/Short","rating":2,"morningstar_category":"Market Neutral","category":"Equity","family":"ProShares","market_cap":"large","description":"The investment seeks investment results, before fees and expenses, that track the performance of the FTSE RAFITM US 1000 Long\/Short Total Return Index (the \\\"index\\\").\\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should track the performance of the index. The index allocates an aggregate equal dollar amount to both long and short equity positions each time that the index rebalances. To be \\\"long\\\" means to hold or have long exposure to an asset with the expectation that its value will increase over time. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"REET","fund_name":"iShares Global REIT ETF","rating":4,"morningstar_category":"Real Estate","category":"Equity","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the FTSE EPRA Nareit Global REITS Index.\\n The index is designed to track the performance of publicly-listed real estate investment trusts (\\\"REITs\\\") (or their local equivalents) in both developed and emerging markets. The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"RFAP","fund_name":"First Trust RiverFront Dynamic Asia Pacific ETF","morningstar_category":"Diversified Pacific\/Asia","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks capital appreciation.\\n The fund invests at least 80% of its net assets (including investment borrowings) in a portfolio of equity securities of \\\"Asian Pacific companies\\\", through investments in common stock, depositary receipts, and common and preferred shares of REITs, and forward foreign currency exchange contracts and currency spot transactions used to hedge the fund's exposure to the currencies in which the equity securities of such Asian Pacific companies are denominated (each, an \\\"Asian Pacific currency\\\" and, collectively, the \\\"Asian Pacific currencies\\\"). It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"RFDI","fund_name":"First Trust RiverFront Dynamic Developed International ETF","morningstar_category":"Foreign Large Blend","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks capital appreciation.\\n The fund will seek to achieve its investment objective by investing at least 80% of its net assets in a portfolio of equity securities of developed market companies, including through investments in common stock, depositary receipts, and common and preferred shares of real estate investment trusts (\\\"REITs\\\"), and forward foreign currency exchange contracts and currency spot transactions used to hedge the fund's exposure to the currencies in which the equity securities of such developed market companies are denominated. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"RFEM","fund_name":"First Trust RiverFront Dynamic Emerging Markets ETF","morningstar_category":"Diversified Emerging Mkts","category":"International","family":"First Trust","market_cap":"large","description":"The investment seeks to provide capital appreciation.\\n The fund invests at least 80% of its net assets (including investment borrowings) in a portfolio of equity securities of emerging market companies, including through investments in common stock, depositary receipts, and common and preferred shares of real estate investment trusts, and forward foreign currency exchange contracts and currency spot transactions used to hedge the fund's exposure to the currencies in which the equity securities of such emerging market companies are denominated. The fund may invest in small, mid and large capitalization companies. It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"RLY","fund_name":"SPDR® SSgA Multi-Asset Real Return ETF","rating":1,"morningstar_category":"Allocation--50% to 70% Equity","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to achieve real return consisting of capital appreciation and current income.\\n Under normal circumstances, the Adviser invests at least 80% of the net assets of the fund among ETPs that provide exposure to the following primary asset classes: (i) inflation protected securities issued by the United States government, its agencies and\/or instrumentalities, as well as inflation protected securities issued by foreign governments, agencies, and\/or instrumentalities; (ii) domestic and international real estate securities; (iii) commodities; and (iv) publicly-traded companies in natural resources and\/or commodities businesses.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"RWO","fund_name":"SPDR® Dow Jones Global Real Estate ETF","rating":4,"morningstar_category":"Global Real Estate","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Dow Jones Global Select Real Estate Securities Indexsm based upon the global real estate market.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a float-adjusted market capitalization index designed to measure the performance of publicly traded global real estate securities. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"RWX","fund_name":"SPDR® Dow Jones International Real Estate ETF","rating":2,"morningstar_category":"Global Real Estate","category":"International","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results, before fees and expenses, correspond generally to the total return performance of the Dow Jones Global ex-U.S. Select Real Estate Securities Indexsm.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a float-adjusted market capitalization index designed to measure the performance of publicly traded real estate securities in countries excluding the United States. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SFHY","fund_name":"WisdomTree Fundamental U.S. Short-Term High Yield Corporate Bond Fund","morningstar_category":"High Yield Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Fundamental U.S. Short-term High Yield Corporate Bond Index.\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to capture the performance of selected issuers in the short-term U.S. non-investment-grade corporate bond market that are deemed to have favorable fundamental and income characteristics. It is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"SHAG","fund_name":"WisdomTree Yield Enhanced U.S. Short-Term Aggregate Bond Fund","morningstar_category":"Short-Term Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg Barclays U.S. Short Aggregate Enhanced Yield Index (the \\\"index\\\").\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to broadly capture the short-term U.S. investment grade, fixed income securities market while seeking to enhance yield within desired risk parameters and constraints. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"SHE","fund_name":"SPDR® SSGA Gender Diversity Index ETF","morningstar_category":"Large Blend","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA Gender Diversity Index, which tracks U.S. companies that are leaders in advancing women through gender diversity on their boards of directors and in management.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. In addition, it may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SHM","fund_name":"SPDR® Nuveen Bloomberg Barclays Short Term Municipal Bond ETF","rating":3,"morningstar_category":"Muni National Short","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays Managed Money Municipal Short Term Index.\\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Sub-Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index tracks the short term tax exempt municipal bond market and provides income that is exempt from federal income taxes. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SHYG","fund_name":"iShares 0-5 Year High Yield Corporate Bond ETF","rating":3,"morningstar_category":"High Yield Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Markit iBoxx® USD Liquid High Yield 0-5 Index composed of U.S. dollar-denominated, high yield corporate bonds with remaining maturities of less than five years.\\n The fund generally invests at least 90% of its assets in the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to reflect the performance of U.S. dollar-denominated high yield corporate debt.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SIZ","fund_name":"AGFiQ U.S. Market Neutral Size Fund","rating":1,"morningstar_category":"Market Neutral","category":"Equity","family":"AGFiQ","market_cap":"mid","description":"The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Size Index.\\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in common stock of the long position in the underlying index and sells short at least 80% of the short positions in the underlying index. As such, it identifies long and short securities positions of approximately equal dollar amounts. In choosing to track a market neutral index, the fund seeks to limit the effects of general market movements on the fund.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SJNK","fund_name":"SPDR® Bloomberg Barclays Short Term High Yield Bond ETF","rating":3,"morningstar_category":"High Yield Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays US High Yield 350mn Cash Pay 0-5 Yr 2% Capped Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of short-term publicly issued U.S. dollar-denominated high yield corporate bonds. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SKYY","fund_name":"First Trust Cloud Computing ETF","rating":3,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield, before the fund's fees and expenses, of an equity index called the ISE Cloud ComputingTM Index.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in common stocks or in depositary receipts representing securities in the index. The index is designed to provide a benchmark for investors interested in tracking companies actively involved in the cloud computing industry.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"SLYG","fund_name":"SPDR® S&P 600 Small Cap Growth ETF","rating":5,"morningstar_category":"Small Growth","category":"Equity","family":"SPDR","market_cap":"small","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P SmallCap 600 Growth Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the small-capitalization growth segment of the U.S. equity market. It may purchase a subset of the securities in the index in an effort to hold a portfolio of securities with generally the same risk and return characteristics of the index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SLYV","fund_name":"SPDR® S&P 600 Small Cap Value ETF","rating":5,"morningstar_category":"Small Value","category":"Equity","family":"SPDR","market_cap":"small","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P SmallCap 600 Value Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the small-capitalization value segment of the U.S. equity market. It may purchase a subset of the securities in the index in an effort to hold a portfolio of securities with generally the same risk and return characteristics of the index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SMEZ","fund_name":"SPDR® EURO STOXX Small Cap ETF","rating":4,"morningstar_category":"Europe Stock","category":"International","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the EURO STOXX Small Index that tracks the performance of small capitalization Eurozone equity securities.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts (including ADRs or GDRs) based on securities comprising the index. The index is designed to provide a representation of small companies across the Eurozone. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SMIN","fund_name":"iShares MSCI India Small-Cap ETF","rating":3,"morningstar_category":"India Equity","category":"International","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the MSCI India Small Cap Index.\\n The fund generally will collectively invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities of small-capitalization companies whose market capitalization, as calculated by the index provider, represents the bottom 14% of companies in the Indian securities market.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"SMLV","fund_name":"SPDR® SSGA US Small Cap Low Volatility Index ETF","rating":5,"morningstar_category":"Small Blend","category":"Bond","family":"SPDR","market_cap":"small","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA US Small Cap Low Volatility Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of the stocks of U.S. small capitalization companies that exhibit low volatility. Volatility is a statistical measurement of the magnitude of movements in a stock's price over time. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPAB","fund_name":"SPDR® Portfolio Aggregate Bond ETF","rating":3,"morningstar_category":"Intermediate-Term Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Aggregate Bond Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the U.S. dollar denominated investment grade bond market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPDW","fund_name":"SPDR® Portfolio Developed World ex-US ETF","rating":4,"morningstar_category":"Foreign Large Blend","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Developed Ex-U.S.BMI Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in developed countries outside the United States. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPEM","fund_name":"SPDR® Portfolio Emerging Markets ETF","rating":4,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"SPDR","market_cap":"large","description":"The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Emerging BMI Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in emerging markets. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPHB","fund_name":"Invesco S&P 500® High Beta ETF","rating":1,"morningstar_category":"Large Blend","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the S&P 500® High Beta Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, S&P DJI selects 100 securities from the S&P 500® Index for inclusion in the underlying index that have the highest sensitivity to market movements, or \\\"beta,\\\" over the past 12 months as determined by the index provider.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPIB","fund_name":"SPDR® Portfolio Intermediate Term Corporate Bond ETF","rating":2,"morningstar_category":"Corporate Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Intermediate Corporate Bond Index.\\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of U.S. corporate bonds that have a maturity of greater than or equal to 1 year and less than 10 years. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPLB","fund_name":"SPDR® Portfolio Long Term Corporate Bond ETF","rating":4,"morningstar_category":"Corporate Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Long Term Corporate Bond Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of U.S. corporate bonds that have a maturity of greater than or equal to 10 years. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPLG","fund_name":"SPDR® Portfolio Large Cap ETF","rating":4,"morningstar_category":"Large Blend","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA Large Cap Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of the large-capitalization segment of the U.S. equity market. The fund may purchase a subset of the securities in the index in an effort to hold a portfolio of securities with generally the same risk and return characteristics of the index. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPMD","fund_name":"SPDR® Portfolio Mid Cap ETF","rating":4,"morningstar_category":"Mid-Cap Blend","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P 1000 Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the small- and mid-capitalization segments of the U.S. equity market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPMO","fund_name":"Invesco S&P 500® Momentum ETF","rating":4,"morningstar_category":"Large Growth","category":"Equity","family":"Invesco","market_cap":"large","description":"The investment seeks to track the investment results (before fees and expenses) of the S&P 500 Momentum Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is designed to track the performance of approximately 100 stocks in the S&P 500® Index that have the highest \\\"momentum score.\\\" In general, momentum is the tendency of an investment to exhibit persistence in its relative performance; a \\\"momentum style\\\" of investing emphasizes investing in securities that have had better recent performance compared to other securities. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPSB","fund_name":"SPDR® Portfolio Short Term Corporate Bond ETF","rating":3,"morningstar_category":"Short-Term Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. 1-3 Year Corporate Bond Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the short term U.S. corporate bond market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPSM","fund_name":"SPDR® Portfolio Small Cap ETF","rating":4,"morningstar_category":"Small Blend","category":"Equity","family":"SPDR","market_cap":"small","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA Small Cap Index that tracks the performance of small capitalization exchange traded U.S. equity securities.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. It may purchase a subset of the securities in the index in an effort to hold a portfolio of securities with generally the same risk and return characteristics of the index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPTL","fund_name":"SPDR® Portfolio Long Term Treasury ETF","rating":4,"morningstar_category":"Long Government","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays Long U.S. Treasury Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of public obligations of the U.S. Treasury that have a remaining maturity of 10 years or more. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPTM","fund_name":"SPDR® Portfolio Total Stock Market ETF","rating":4,"morningstar_category":"Large Blend","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA Total Stock Market Index that tracks a broad universe of exchange traded U.S. equity securities.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. It may invest in equity securities that are not included in the index (including common stock, preferred stock, depositary receipts and shares of other investment companies), cash and cash equivalents or money market instruments. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPTS","fund_name":"SPDR® Portfolio Short Term Treasury ETF","rating":4,"morningstar_category":"Short Government","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays 1-3 Year U.S. Treasury Index.\\n The fund invests at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of short term (1-3 years) public obligations of the U.S. Treasury. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPYD","fund_name":"SPDR® Portfolio S&P 500 High Dividend ETF","rating":5,"morningstar_category":"Large Value","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to track the performance of the S&P 500 High Dividend Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of 80 high dividend-yielding companies within the S&P 500® Index. The S&P 500 Index focuses on the large capitalization U.S. equity market, including common stock and real estate investment trusts (\\\"REITs\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPYG","fund_name":"SPDR® Portfolio S&P 500 Growth ETF","rating":4,"morningstar_category":"Large Growth","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P 500 Growth Index that tracks the performance of large capitalization exchange traded U.S. equity securities exhibiting \\\"growth\\\" characteristics.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the large-capitalization growth segment of the U.S. equity market. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPYV","fund_name":"SPDR® Portfolio S&P 500 Value ETF","rating":3,"morningstar_category":"Large Value","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P 500 Value Index that tracks the performance of large capitalization exchange traded U.S. equity securities exhibiting \\\"value\\\" characteristics.\\n The fund employs a sampling strategy in seeking to track the performance of the S&P 500 Value Index. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the large-capitalization value segment of the U.S. equity market. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SPYX","fund_name":"SPDR® S&P 500 Fossil Fuel Reserves Free ETF","rating":4,"morningstar_category":"Large Blend","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P 500 Fossil Fuel Free Index.\\n Normally, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. In addition, it may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments. The index is designed to measure the performance of companies in the S&P 500 Index that do not own fossil fuel reserves. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SRLN","fund_name":"SPDR® Blackstone \/ GSO Senior Loan ETF","rating":3,"morningstar_category":"Bank Loan","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide current income consistent with the preservation of capital.\\n Under normal circumstances, the fund invests substantially all of its assets in the Blackstone \/ GSO Senior Loan Portfolio, a separate series of the SSGA Master Trust with an identical investment objective as the fund. As a result, the fund invests indirectly through the Portfolio. In pursuing its investment objective, the Portfolio seeks to outperform the Markit iBoxx USD Liquid Leveraged Loan Index and the S&P\/LSTA U.S. Leveraged Loan 100 Index by normally investing at least 80% of its net assets (plus any borrowings for investment purposes) in Senior Loans.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"STIP","fund_name":"iShares 0-5 Year TIPS Bond ETF","rating":2,"morningstar_category":"Inflation-Protected Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the Bloomberg Barclays U.S. Treasury Inflation-Protected Securities (TIPS) 0-5 Years Index (Series-L).\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of the inflation-protected public obligations of the U.S. Treasury, commonly known as \\\"TIPS,\\\" that have a remaining maturity of less than five years.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"STOT","fund_name":"SPDR® DoubleLine Short Duration Total Return Tactical ETF","morningstar_category":"Short-Term Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to maximize current income with a dollar-weighted average effective duration between one and three years.\\n Under normal circumstances, the fund will invest at least 80% of its net assets in a diversified portfolio of fixed income securities of any credit quality. Fixed income securities in which the fund principally invests are defined as securities issued or guaranteed by the U.S. government or its agencies, instrumentalities or sponsored corporations; TIPS; municipal bonds (the fund may invest up to 20% of its portfolio in municipal bonds); asset-backed securities; etc.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"SUB","fund_name":"iShares Short-Term National Muni Bond ETF","rating":2,"morningstar_category":"Muni National Short","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the S&P Short Term National AMT-Free Municipal Bond IndexTM.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of the short-term investment-grade segment of the U.S. municipal bond market.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SYE","fund_name":"SPDR® MFS Systematic Core Equity ETF","rating":4,"morningstar_category":"Large Blend","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks capital appreciation.\\n Under normal circumstances, the fund invests at least 80% of its net assets (plus the amount of borrowings for investment purposes) in equity securities. Equity securities in which the fund invests include common stocks, preferred stocks, and securities convertible into stocks. In selecting securities for the fund, the Sub-Adviser utilizes a bottom-up approach to buying and selling investments for the fund.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SYG","fund_name":"SPDR® MFS Systematic Growth Equity ETF","rating":2,"morningstar_category":"Large Growth","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks capital appreciation.\\n Under normal circumstances, the fund invests at least 80% of its net assets (plus the amount of borrowings for investment purposes) in equity securities. Equity securities in which the fund invests include common stocks, preferred stocks, and securities convertible into stocks. In selecting securities for the fund, the Sub-Adviser utilizes a bottom-up approach to buying and selling investments for the fund.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"SYV","fund_name":"SPDR® MFS Systematic Value Equity ETF","rating":4,"morningstar_category":"Large Value","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks capital appreciation.\\n Under normal circumstances, the fund invests at least 80% of its net assets (plus the amount of borrowings for investment purposes) in equity securities. Equity securities in which the fund invests include common stocks, preferred stocks, and securities convertible into stocks. In selecting securities for the fund, the Sub-Adviser utilizes a bottom-up approach to buying and selling investments for the fund.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"TDIV","fund_name":"First Trust NASDAQ Technology Dividend Index Fund","rating":2,"morningstar_category":"Technology","category":"Equity","family":"First Trust","market_cap":"large","description":"The investment seeks investment results that correspond generally to the price and yield (before the fund's fees and expenses) of an equity index called the NASDAQ Technology Dividend IndexSM.\\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and\/or depositary receipts included in the index. The index is owned and was developed by Nasdaq, Inc. (the \\\"index provider\\\"). The index is calculated and maintained by the index Provider. The index includes up to 100 technology and telecommunications companies that pay a regular or common dividend. The fund is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"TFI","fund_name":"SPDR® Nuveen Bloomberg Barclays Municipal Bond ETF","rating":2,"morningstar_category":"Muni National Long","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks investment results that correspond generally to the price and yield performance of the Bloomberg Barclays Municipal Managed Money 1-25 Years Index.\\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Sub-Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to track the U.S. fully tax-exempt bond market. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"TIPX","fund_name":"SPDR® Bloomberg Barclays 1-10 Year TIPS ETF","rating":3,"morningstar_category":"Inflation-Protected Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays 1-10 Year U.S. Government Inflation-Linked Bond Index that tracks the 1-10 year inflation protected sector of the United States Treasury market.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"TOLZ","fund_name":"ProShares DJ Brookfield Global Infrastructure ET","rating":2,"morningstar_category":"Infrastructure","category":"Equity","family":"ProShares","market_cap":"large","description":"The investment seeks investment results, before fees and expenses, that track the performance of the Dow Jones Brookfield Global Infrastructure Composite Index (the \\\"index\\\").\\n The index consists of companies domiciled globally that qualify as \\\"pure-play\\\" infrastructure companies-companies whose primary business is the ownership and operation of infrastructure assets, activities that generally generate long-term stable cash flows. Under normal circumstances, the fund will invest at least 80% of its total assets in component securities.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"UEVM","fund_name":"USAA MSCI Emerging Markets Value Momentum Blend Index ETF","morningstar_category":"Diversified Emerging Mkts","category":"International","family":"USAA","market_cap":"large","description":"The investment seeks to provide investment results that correspond to the MSCI Emerging Markets Select Value Momentum Blend Index.\\n The fund seeks to achieve by investing at least 80% of its net assets in securities in the index, depositary receipts on securities in the index, and securities underlying depositary receipts in the index. The index is designed to deliver exposure to equity market performance in the global emerging markets and provide higher exposure to value and momentum factors within the MSCI Emerging Markets Index while also maintaining moderate index turnover and lower realized volatility than traditional capitalization weighted indexes.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"UIVM","fund_name":"USAA MSCI International Value Momentum Blend Index ETF","morningstar_category":"Foreign Large Value","category":"International","family":"USAA","market_cap":"large","description":"The investment seeks to provide investment results that correspond to the MSCI World ex USA Select Value Momentum Blend Index.\\n The fund seeks to achieve its investment objective by investing at least 80% of its net assets in securities in the index, depositary receipts on securities in the index, and securities underlying depositary receipts in the index. The index is designed to deliver exposure to equity market performance in non-U.S. markets and provide higher exposure to value and momentum factors within the MSCI World ex USA Index while also maintaining moderate index turnover and lower realized volatility than traditional capitalization weighted indexes.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ULST","fund_name":"SPDR® SSgA Ultra Short Term Bond ETF","rating":3,"morningstar_category":"Ultrashort Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide current income consistent with preservation of capital and daily liquidity through short duration high quality investments.\\n The Adviser invests, under normal circumstances, at least 80% of the fund's net assets (plus the amount of borrowings for investment purposes) in a diversified portfolio of U.S. dollar-denominated investment-grade fixed income securities. The fund may also invest in exchange traded products (\\\"ETPs\\\"). It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"ULVM","fund_name":"USAA MSCI USA Value Momentum Blend Index ETF","morningstar_category":"Large Blend","category":"Equity","family":"USAA","market_cap":"large","description":"The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the MSCI USA Select Value Momentum Blend Index.\\n Under normal circumstances, the fund seeks to achieve its investment objective by investing at least 80% of its net assets in securities in the index. The index is designed to deliver exposure to equity securities of large- and mid-capitalization U.S. issuers that have higher exposure to value and momentum factors within the MSCI USA Index (the \\\"parent index\\\") while also maintaining moderate index turnover and lower realized volatility than traditional capitalization weighted indexes.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"USDU","fund_name":"WisdomTree Bloomberg U.S. Dollar Bullish Fund","morningstar_category":"Multicurrency","category":"Equity","family":"WisdomTree","market_cap":null,"description":"The investment seeks to provide total returns, before fees and expenses, that exceed the performance of the Bloomberg Dollar Total Return Index (the \\\"index\\\").\\n The fund is an actively managed ETF that seeks to provide total returns, before fees and expenses, that exceed the performance of the index. The index is structured to potentially benefit as the U.S. dollar appreciates relative to a basket of global currencies. The fund will seek exposure to both the U.S. dollar and global currencies held by the index through investing, under normal circumstances, at least 80% of its assets in money market securities and other liquid securities. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"USFR","fund_name":"WisdomTree Floating Rate Treasury Fund","rating":5,"morningstar_category":"Short Government","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg U.S. Treasury Floating Rate Bond Index (the \\\"index\\\").\\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to measure the performance of floating rate public obligations of the U.S. Treasury. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"USHY","fund_name":"iShares Broad USD High Yield Corporate Bond ETF","morningstar_category":"High Yield Bond","category":"Bond","family":"iShares","market_cap":null,"description":"The investment seeks to track the investment results of the ICE BofAML US High Yield Constrained Index.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates, as well as in securities not included in the underlying index. The underlying index is designed to provide a broad representation of the U.S. dollar-denominated high yield corporate bond market. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"USMF","fund_name":"WisdomTree U.S. Multifactor Fund","morningstar_category":"Large Blend","category":"Equity","family":"WisdomTree","market_cap":"mid","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. Multifactor Index.\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is generally comprised of 200 U.S. companies with the highest composite scores based on two fundamental factors (value and quality measures) and two technical factors (momentum and correlation). The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"USRT","fund_name":"iShares Core U.S. REIT ETF","rating":3,"morningstar_category":"Real Estate","category":"Equity","family":"iShares","market_cap":"mid","description":"The investment seeks to track the investment results of the FTSE Nareit Equity REITS Index composed of U.S. real estate equities.\\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of U.S. listed equity real estate investment trusts (\\\"REITs\\\"), excluding infrastructure REITs, mortgage REITs, and timber REITs.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"USVM","fund_name":"USAA MSCI USA Small Cap Value Momentum Blend Index ETF","morningstar_category":"Small Blend","category":"Equity","family":"USAA","market_cap":"small","description":"The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the MSCI USA Small Cap Select Value Momentum Blend Index.\\n Under normal circumstances, the fund seeks to achieve its investment objective by investing at least 80% of its net assets in securities in the index. The index is designed to deliver exposure to equity securities of small-capitalization U.S. issuers that have higher exposure to value and momentum factors within the MSCI USA Small Cap Index while also maintaining moderate Index turnover and lower realized volatility than traditional capitalization weighted indexes.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"VIXM","fund_name":"ProShares VIX Mid-Term Futures ETF","morningstar_category":"Volatility","category":"Equity","family":"ProShares","market_cap":null,"description":"The investment seeks results that, both over a single day and over time, match (before fees and expenses) the performance of the S&P 500® VIX Mid-Term Futures Index.\\n The fund seeks to meet its investment objective under normal market conditions by taking long or short positions in VIX futures contracts. It will also hold cash or cash equivalents such as U.S. Treasury securities or other high credit quality, short-term fixed-income or similar securities (such as shares of money market funds) as collateral for Financial Instruments and pending investment in Financial Instruments.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"VRIG","fund_name":"Invesco Variable Rate Investment Grade ETF","morningstar_category":"Ultrashort Bond","category":"Bond","family":"Invesco","market_cap":null,"description":"The investment seeks to generate current income while maintaining low portfolio duration as a primary objective and capital appreciation as a secondary objective.\\n The fund invests at least 80% of its net assets (plus any borrowings for investment purposes) in a portfolio of investment-grade, variable rate or floating rate debt securities. At least 80% of its net assets (plus any borrowings for investment purposes) will be invested in Variable Rate Instruments that are, at the time of purchase, investment grade (or in affiliated ETFs that invest primarily in any or all of the foregoing securities). It is non-diversified.","exchange":"NASDAQ Global Market"}
{"index":{}}
{"symbol":"VRP","fund_name":"Invesco Variable Rate Preferred ETF","rating":4,"morningstar_category":"Preferred Stock","category":"Bond","family":"Invesco","market_cap":null,"description":"The investment seeks to track the investment results (before fees and expenses) of the Wells Fargo® Hybrid and Preferred Securities Floating and Variable Rate Index.\\n The fund will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is a market capitalization-weighted index designed to track the performance of preferred stock, as well as certain types of hybrid securities that are functionally equivalent to preferred stocks, that are issued by U.S.-based or foreign issuers and that pay a floating or variable rate dividend or coupon. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"WBAL","fund_name":"WisdomTree Balanced Income Fund","morningstar_category":"Allocation--50% to 70% Equity","category":"Equity","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Balanced Income Index.\\n Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to provide a balanced exposure to global equities and fixed income, including developed and emerging markets. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"WCHN","fund_name":"WisdomTree ICBCCS S&P China 500 Fund","morningstar_category":"China Region","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the S&P China 500 Index.\\n Under normal circumstances, at least 80% of the fund's total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index selects the largest 500 eligible companies from the broader S&P Total China BMI Index. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"WFHY","fund_name":"WisdomTree Fundamental U.S. High Yield Corporate Bond Fund","morningstar_category":"High Yield Bond","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Fundamental U.S. High Yield Corporate Bond Index.\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to capture the performance of selected issuers in the U.S. non-investment-grade corporate bond market that are deemed to have favorable fundamental and income characteristics. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"WIP","fund_name":"SPDR® FTSE International Government Inflation-Protected Bond ETF","rating":3,"morningstar_category":"World Bond","category":"Bond","family":"SPDR","market_cap":null,"description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the FTSE International Inflation-Linked Securities Select Index.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index or in securities that the Adviser determines have economic characteristics. The index is designed to measure the total return performance of inflation-linked bonds outside the United States with fixed-rate coupon payments that are linked to an inflation index. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"WTMF","fund_name":"WisdomTree Managed Futures Strategy Fund","rating":3,"morningstar_category":"Managed Futures","category":"Bond","family":"WisdomTree","market_cap":null,"description":"The investment seeks to provide investors with positive total returns in rising or falling markets.\\n The fund normally invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in \\\"managed futures\\\". It is an actively managed exchange traded fund (\\\"ETF\\\") that seeks to achieve positive total returns in rising or falling markets that are not directly correlated to broad market equity or fixed income returns. The fund is managed using a quantitative, rules-based strategy designed to provide returns that correspond to the performance of the WisdomTree Managed Futures Index. It is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XAR","fund_name":"SPDR® S&P Aerospace & Defense ETF","rating":5,"morningstar_category":"Industrials","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Aerospace & Defense Select Industry Index.\\n In seeking to track the performance of the S&P Aerospace & Defense Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the aerospace and defense segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XHB","fund_name":"SPDR® S&P Homebuilders ETF","rating":1,"morningstar_category":"Consumer Cyclical","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the homebuilding segment of a U.S. total market composite index.\\n In seeking to track the performance of the S&P Homebuilders Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the homebuilders segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XHE","fund_name":"SPDR® S&P Health Care Equipment ETF","rating":5,"morningstar_category":"Health","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the health care equipment and supplies segment of a U.S. total market composite index.\\n In seeking to track the performance of the S&P Health Care Equipment Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the health care equipment segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XKFS","fund_name":"SPDR® Kensho Future Security ETF","morningstar_category":"World Large Stock","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Kensho Future Security Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is comprised of U.S.-listed equity securities (including depositary receipts) of companies domiciled across developed and emerging markets worldwide which are included in the Future Security sector as determined by a classification standard produced by the index provider. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XKII","fund_name":"SPDR® Kensho Intelligent Structures ETF","morningstar_category":"Infrastructure","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Kensho Intelligent Infrastructure Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is comprised of U.S.-listed equity securities (including depositary receipts) of companies domiciled across developed and emerging markets worldwide which are included in the Intelligent Infrastructure sector as determined by a classification standard produced by the index provider. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XKST","fund_name":"SPDR® Kensho Smart Mobility ETF","morningstar_category":"Mid-Cap Growth","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Kensho Smart Transportation Index.\\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is comprised of U.S.-listed equity securities (including depositary receipts) of companies domiciled across developed and emerging markets worldwide which are included in the Smart Transportation sector as determined by a classification standard produced by the index provider. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XMLV","fund_name":"Invesco S&P MidCap Low Volatility ETF","rating":5,"morningstar_category":"Mid-Cap Value","category":"Bond","family":"Invesco","market_cap":"mid","description":"The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400® Low Volatility Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its procedures and mandated guidelines, the index provider selects for inclusion in the underlying index the 80 securities that it has determined have the lowest volatility over the past 12 months out of the 400 medium capitalization securities that are contained in the S&P MidCap 400® Index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XNTK","fund_name":"SPDR® NYSE Technology ETF","rating":3,"morningstar_category":"Technology","category":"Equity","family":"SPDR","market_cap":"large","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the NYSE Technology Index that tracks the performance of publicly traded technology companies.\\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. It may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments, such as repurchase agreements and money market funds. The index is composed of 35 leading U.S.-listed technology-related companies. The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XSD","fund_name":"SPDR® S&P Semiconductor ETF","rating":3,"morningstar_category":"Technology","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the semiconductor segment of a U.S. total market composite index.\\n In seeking to track the performance of the S&P Semiconductor Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the semiconductors segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XSHQ","fund_name":"Invesco S&P SmallCap Quality ETF","morningstar_category":"Small Growth","category":"Equity","family":"Invesco","market_cap":"small","description":"The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600® Quality Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. S&P DJI weights each component stock of the underlying index by the total of its quality score multiplied by its market capitalization; stocks with higher scores receive relatively greater weights. The fund is non-diversified.","exchange":"Cboe Global Markets EDGX"}
{"index":{}}
{"symbol":"XSLV","fund_name":"Invesco S&P SmallCap Low Volatility ETF","rating":5,"morningstar_category":"Small Value","category":"Bond","family":"Invesco","market_cap":"small","description":"The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600® Low Volatility Index (the \\\"underlying index\\\").\\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its procedures and mandated guidelines, S&P DJI selects for inclusion in the underlying index the 120 securities that it has determined have the lowest volatility over the past 12 months out of the 600 small-capitalization securities that are contained in the S&P SmallCap 600® Index.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XSOE","fund_name":"WisdomTree Emerging Markets ex-State-Owned Enterprises Fund","rating":3,"morningstar_category":"Diversified Emerging Mkts","category":"International","family":"WisdomTree","market_cap":"large","description":"The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Emerging Markets ex-State-Owned Enterprises Index (the \\\"index\\\").\\n Under normal circumstances, at least 80% of the fund's total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a modified float-adjusted market cap weighted index that consists of common stocks in emerging markets, excluding common stocks of \\\"state-owned enterprises.\\\" The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XSW","fund_name":"SPDR® S&P Software & Services ETF","rating":3,"morningstar_category":"Technology","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the computer software segment of a U.S. total market composite index.\\n In seeking to track the performance of the S&P Software & Services Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the software and services segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}
{"index":{}}
{"symbol":"XTN","fund_name":"SPDR® S&P Transportation ETF","rating":3,"morningstar_category":"Industrials","category":"Equity","family":"SPDR","market_cap":"mid","description":"The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the transportation segment of a U.S. total market composite index.\\n In seeking to track the performance of the S&P Transportation Select Industry Index (the \\\"index\\\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the transportation segment of the S&P Total Market Index (\\\"S&P TMI\\\"). The fund is non-diversified.","exchange":"NYSE Arca"}

